tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
/*******************************************************************************
* File Name: I2CIF.h
* Version 3.10
*
* Description:
*  This file provides constants and parameter values for the SCB Component.
*
* Note:
*
********************************************************************************
* Copyright 2013-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_SCB_I2CIF_H)
#define CY_SCB_I2CIF_H

#include <cydevice_trm.h>
#include <cyfitter.h>
#include <cytypes.h>
#include <CyLib.h>

/* SCB IP block v0 is available in PSoC 4100/PSoC 4200 */
#define I2CIF_CY_SCBIP_V0    (CYIPBLOCK_m0s8scb_VERSION == 0u)
/* SCB IP block v1 is available in PSoC 4000 */
#define I2CIF_CY_SCBIP_V1    (CYIPBLOCK_m0s8scb_VERSION == 1u)
/* SCB IP block v2 is available in all other devices */
#define I2CIF_CY_SCBIP_V2    (CYIPBLOCK_m0s8scb_VERSION >= 2u)

#define I2CIF_SCB_MODE                     (1u)

/* SCB modes enum */
#define I2CIF_SCB_MODE_I2C                 (0x01u)
#define I2CIF_SCB_MODE_SPI                 (0x02u)
#define I2CIF_SCB_MODE_UART                (0x04u)
#define I2CIF_SCB_MODE_EZI2C               (0x08u)
#define I2CIF_SCB_MODE_UNCONFIG            (0xFFu)

/* Condition compilation depends on operation mode: Unconfigured implies apply to all modes */
#define I2CIF_SCB_MODE_I2C_CONST_CFG       (I2CIF_SCB_MODE_I2C       == I2CIF_SCB_MODE)
#define I2CIF_SCB_MODE_SPI_CONST_CFG       (I2CIF_SCB_MODE_SPI       == I2CIF_SCB_MODE)
#define I2CIF_SCB_MODE_UART_CONST_CFG      (I2CIF_SCB_MODE_UART      == I2CIF_SCB_MODE)
#define I2CIF_SCB_MODE_EZI2C_CONST_CFG     (I2CIF_SCB_MODE_EZI2C     == I2CIF_SCB_MODE)
#define I2CIF_SCB_MODE_UNCONFIG_CONST_CFG  (I2CIF_SCB_MODE_UNCONFIG  == I2CIF_SCB_MODE)

/* Condition compilation for includes */
#define I2CIF_SCB_MODE_I2C_INC      (0u !=(I2CIF_SCB_MODE_I2C   & I2CIF_SCB_MODE))
#define I2CIF_SCB_MODE_EZI2C_INC    (0u !=(I2CIF_SCB_MODE_EZI2C & I2CIF_SCB_MODE))
#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_SCB_MODE_SPI_INC  (0u !=(I2CIF_SCB_MODE_SPI   & I2CIF_SCB_MODE))
    #define I2CIF_SCB_MODE_UART_INC (0u !=(I2CIF_SCB_MODE_UART  & I2CIF_SCB_MODE))
#else
    #define I2CIF_SCB_MODE_SPI_INC  (0u)
    #define I2CIF_SCB_MODE_UART_INC (0u)
#endif /* (!I2CIF_CY_SCBIP_V1) */

/* Interrupts remove options */
#define I2CIF_REMOVE_SCB_IRQ             (0u)
#define I2CIF_SCB_IRQ_INTERNAL           (0u == I2CIF_REMOVE_SCB_IRQ)

#define I2CIF_REMOVE_UART_RX_WAKEUP_IRQ  (1u)
#define I2CIF_UART_RX_WAKEUP_IRQ         (0u == I2CIF_REMOVE_UART_RX_WAKEUP_IRQ)

/* SCB interrupt enum */
#define I2CIF_SCB_INTR_MODE_NONE     (0u)
#define I2CIF_SCB_INTR_MODE_INTERNAL (1u)
#define I2CIF_SCB_INTR_MODE_EXTERNAL (2u)

/* Internal clock remove option */
#define I2CIF_REMOVE_SCB_CLK     (0u)
#define I2CIF_SCB_CLK_INTERNAL   (0u == I2CIF_REMOVE_SCB_CLK)


/***************************************
*       Includes
****************************************/

#include "I2CIF_PINS.h"

#if (I2CIF_SCB_CLK_INTERNAL)
    #include "I2CIF_SCBCLK.h"
#endif /* (I2CIF_SCB_CLK_INTERNAL) */


/***************************************
*       Type Definitions
***************************************/

typedef struct
{
    uint8 enableState;
} I2CIF_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

/* Start and Stop APIs */
void I2CIF_Init(void);
void I2CIF_Enable(void);
void I2CIF_Start(void);
void I2CIF_Stop(void);

/* Sleep and Wakeup APis */
void I2CIF_Sleep(void);
void I2CIF_Wakeup(void);

#if (I2CIF_SCB_IRQ_INTERNAL)
    /* Custom interrupt handler */
    void I2CIF_SetCustomInterruptHandler(void (*func)(void));
#endif /* (I2CIF_SCB_IRQ_INTERNAL) */

/* Interface to internal interrupt component */
#if (I2CIF_SCB_IRQ_INTERNAL)
    #define I2CIF_EnableInt()        CyIntEnable      (I2CIF_ISR_NUMBER)
    #define I2CIF_DisableInt()       CyIntDisable     (I2CIF_ISR_NUMBER)
    #define I2CIF_ClearPendingInt()  CyIntClearPending(I2CIF_ISR_NUMBER)
#endif /* (I2CIF_SCB_IRQ_INTERNAL) */

#if (I2CIF_UART_RX_WAKEUP_IRQ)
    #define I2CIF_RxWakeEnableInt()        CyIntEnable      (I2CIF_RX_WAKE_ISR_NUMBER)
    #define I2CIF_RxWakeDisableInt()       CyIntDisable     (I2CIF_RX_WAKE_ISR_NUMBER)
    #define I2CIF_RxWakeClearPendingInt()  CyIntClearPending(I2CIF_RX_WAKE_ISR_NUMBER)
#endif /* (I2CIF_UART_RX_WAKEUP_IRQ) */

/* Get interrupt cause */
#define I2CIF_GetInterruptCause()    (I2CIF_INTR_CAUSE_REG)

/* APIs to service INTR_RX register */
#define I2CIF_SetRxInterruptMode(interruptMask)     I2CIF_WRITE_INTR_RX_MASK(interruptMask)
#define I2CIF_ClearRxInterruptSource(interruptMask) I2CIF_CLEAR_INTR_RX(interruptMask)
#define I2CIF_SetRxInterrupt(interruptMask)         I2CIF_SET_INTR_RX(interruptMask)
#define I2CIF_GetRxInterruptSource()                (I2CIF_INTR_RX_REG)
#define I2CIF_GetRxInterruptMode()                  (I2CIF_INTR_RX_MASK_REG)
#define I2CIF_GetRxInterruptSourceMasked()          (I2CIF_INTR_RX_MASKED_REG)
void I2CIF_SetRxFifoLevel(uint32 level);

/* APIs to service INTR_TX register */
#define I2CIF_SetTxInterruptMode(interruptMask)     I2CIF_WRITE_INTR_TX_MASK(interruptMask)
#define I2CIF_ClearTxInterruptSource(interruptMask) I2CIF_CLEAR_INTR_TX(interruptMask)
#define I2CIF_SetTxInterrupt(interruptMask)         I2CIF_SET_INTR_TX(interruptMask)
#define I2CIF_GetTxInterruptSource()                (I2CIF_INTR_TX_REG)
#define I2CIF_GetTxInterruptMode()                  (I2CIF_INTR_TX_MASK_REG)
#define I2CIF_GetTxInterruptSourceMasked()          (I2CIF_INTR_TX_MASKED_REG)
void I2CIF_SetTxFifoLevel(uint32 level);

