tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
/* APIs to service INTR_MASTER register */
#define I2CIF_SetMasterInterruptMode(interruptMask)    I2CIF_WRITE_INTR_MASTER_MASK(interruptMask)
#define I2CIF_ClearMasterInterruptSource(interruptMask) I2CIF_CLEAR_INTR_MASTER(interruptMask)
#define I2CIF_SetMasterInterrupt(interruptMask)         I2CIF_SET_INTR_MASTER(interruptMask)
#define I2CIF_GetMasterInterruptSource()                (I2CIF_INTR_MASTER_REG)
#define I2CIF_GetMasterInterruptMode()                  (I2CIF_INTR_MASTER_MASK_REG)
#define I2CIF_GetMasterInterruptSourceMasked()          (I2CIF_INTR_MASTER_MASKED_REG)

/* APIs to service INTR_SLAVE register */
#define I2CIF_SetSlaveInterruptMode(interruptMask)     I2CIF_WRITE_INTR_SLAVE_MASK(interruptMask)
#define I2CIF_ClearSlaveInterruptSource(interruptMask) I2CIF_CLEAR_INTR_SLAVE(interruptMask)
#define I2CIF_SetSlaveInterrupt(interruptMask)         I2CIF_SET_INTR_SLAVE(interruptMask)
#define I2CIF_GetSlaveInterruptSource()                (I2CIF_INTR_SLAVE_REG)
#define I2CIF_GetSlaveInterruptMode()                  (I2CIF_INTR_SLAVE_MASK_REG)
#define I2CIF_GetSlaveInterruptSourceMasked()          (I2CIF_INTR_SLAVE_MASKED_REG)


/***************************************
*     Vars with External Linkage
***************************************/

extern uint8 I2CIF_initVar;


/***************************************
*              Registers
***************************************/

#define I2CIF_CTRL_REG               (*(reg32 *) I2CIF_SCB__CTRL)
#define I2CIF_CTRL_PTR               ( (reg32 *) I2CIF_SCB__CTRL)

#define I2CIF_STATUS_REG             (*(reg32 *) I2CIF_SCB__STATUS)
#define I2CIF_STATUS_PTR             ( (reg32 *) I2CIF_SCB__STATUS)

#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_SPI_CTRL_REG           (*(reg32 *) I2CIF_SCB__SPI_CTRL)
    #define I2CIF_SPI_CTRL_PTR           ( (reg32 *) I2CIF_SCB__SPI_CTRL)

    #define I2CIF_SPI_STATUS_REG         (*(reg32 *) I2CIF_SCB__SPI_STATUS)
    #define I2CIF_SPI_STATUS_PTR         ( (reg32 *) I2CIF_SCB__SPI_STATUS)

    #define I2CIF_UART_CTRL_REG          (*(reg32 *) I2CIF_SCB__UART_CTRL)
    #define I2CIF_UART_CTRL_PTR          ( (reg32 *) I2CIF_SCB__UART_CTRL)

    #define I2CIF_UART_TX_CTRL_REG       (*(reg32 *) I2CIF_SCB__UART_TX_CTRL)
    #define I2CIF_UART_TX_CTRL_PTR       ( (reg32 *) I2CIF_SCB__UART_TX_CTRL)

    #define I2CIF_UART_RX_CTRL_REG       (*(reg32 *) I2CIF_SCB__UART_RX_CTRL)
    #define I2CIF_UART_RX_CTRL_PTR       ( (reg32 *) I2CIF_SCB__UART_RX_CTRL)

    #define I2CIF_UART_RX_STATUS_REG     (*(reg32 *) I2CIF_SCB__UART_RX_STATUS)
    #define I2CIF_UART_RX_STATUS_PTR     ( (reg32 *) I2CIF_SCB__UART_RX_STATUS)
#endif /* (!I2CIF_CY_SCBIP_V1) */

#if !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_UART_FLOW_CTRL_REG     (*(reg32 *) I2CIF_SCB__UART_FLOW_CTRL)
    #define I2CIF_UART_FLOW_CTRL_PTR     ( (reg32 *) I2CIF_SCB__UART_FLOW_CTRL)
#endif /* !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */

#define I2CIF_I2C_CTRL_REG           (*(reg32 *) I2CIF_SCB__I2C_CTRL)
#define I2CIF_I2C_CTRL_PTR           ( (reg32 *) I2CIF_SCB__I2C_CTRL)

#define I2CIF_I2C_STATUS_REG         (*(reg32 *) I2CIF_SCB__I2C_STATUS)
#define I2CIF_I2C_STATUS_PTR         ( (reg32 *) I2CIF_SCB__I2C_STATUS)

#define I2CIF_I2C_MASTER_CMD_REG     (*(reg32 *) I2CIF_SCB__I2C_M_CMD)
#define I2CIF_I2C_MASTER_CMD_PTR     ( (reg32 *) I2CIF_SCB__I2C_M_CMD)

#define I2CIF_I2C_SLAVE_CMD_REG      (*(reg32 *) I2CIF_SCB__I2C_S_CMD)
#define I2CIF_I2C_SLAVE_CMD_PTR      ( (reg32 *) I2CIF_SCB__I2C_S_CMD)

#define I2CIF_I2C_CFG_REG            (*(reg32 *) I2CIF_SCB__I2C_CFG)
#define I2CIF_I2C_CFG_PTR            ( (reg32 *) I2CIF_SCB__I2C_CFG)

#define I2CIF_TX_CTRL_REG            (*(reg32 *) I2CIF_SCB__TX_CTRL)
#define I2CIF_TX_CTRL_PTR            ( (reg32 *) I2CIF_SCB__TX_CTRL)

#define I2CIF_TX_FIFO_CTRL_REG       (*(reg32 *) I2CIF_SCB__TX_FIFO_CTRL)
#define I2CIF_TX_FIFO_CTRL_PTR       ( (reg32 *) I2CIF_SCB__TX_FIFO_CTRL)

#define I2CIF_TX_FIFO_STATUS_REG     (*(reg32 *) I2CIF_SCB__TX_FIFO_STATUS)
#define I2CIF_TX_FIFO_STATUS_PTR     ( (reg32 *) I2CIF_SCB__TX_FIFO_STATUS)

#define I2CIF_TX_FIFO_WR_REG         (*(reg32 *) I2CIF_SCB__TX_FIFO_WR)
#define I2CIF_TX_FIFO_WR_PTR         ( (reg32 *) I2CIF_SCB__TX_FIFO_WR)

#define I2CIF_RX_CTRL_REG            (*(reg32 *) I2CIF_SCB__RX_CTRL)
#define I2CIF_RX_CTRL_PTR            ( (reg32 *) I2CIF_SCB__RX_CTRL)

#define I2CIF_RX_FIFO_CTRL_REG       (*(reg32 *) I2CIF_SCB__RX_FIFO_CTRL)
#define I2CIF_RX_FIFO_CTRL_PTR       ( (reg32 *) I2CIF_SCB__RX_FIFO_CTRL)

#define I2CIF_RX_FIFO_STATUS_REG     (*(reg32 *) I2CIF_SCB__RX_FIFO_STATUS)
#define I2CIF_RX_FIFO_STATUS_PTR     ( (reg32 *) I2CIF_SCB__RX_FIFO_STATUS)

#define I2CIF_RX_MATCH_REG           (*(reg32 *) I2CIF_SCB__RX_MATCH)
#define I2CIF_RX_MATCH_PTR           ( (reg32 *) I2CIF_SCB__RX_MATCH)

#define I2CIF_RX_FIFO_RD_REG         (*(reg32 *) I2CIF_SCB__RX_FIFO_RD)
#define I2CIF_RX_FIFO_RD_PTR         ( (reg32 *) I2CIF_SCB__RX_FIFO_RD)

#define I2CIF_RX_FIFO_RD_SILENT_REG  (*(reg32 *) I2CIF_SCB__RX_FIFO_RD_SILENT)
#define I2CIF_RX_FIFO_RD_SILENT_PTR  ( (reg32 *) I2CIF_SCB__RX_FIFO_RD_SILENT)

#define I2CIF_EZBUF_DATA00_REG       (*(reg32 *) I2CIF_SCB__EZ_DATA00)
#define I2CIF_EZBUF_DATA00_PTR       ( (reg32 *) I2CIF_SCB__EZ_DATA00)

#define I2CIF_INTR_CAUSE_REG         (*(reg32 *) I2CIF_SCB__INTR_CAUSE)
#define I2CIF_INTR_CAUSE_PTR         ( (reg32 *) I2CIF_SCB__INTR_CAUSE)

#define I2CIF_INTR_I2C_EC_REG        (*(reg32 *) I2CIF_SCB__INTR_I2C_EC)
#define I2CIF_INTR_I2C_EC_PTR        ( (reg32 *) I2CIF_SCB__INTR_I2C_EC)

#define I2CIF_INTR_I2C_EC_MASK_REG   (*(reg32 *) I2CIF_SCB__INTR_I2C_EC_MASK)
#define I2CIF_INTR_I2C_EC_MASK_PTR   ( (reg32 *) I2CIF_SCB__INTR_I2C_EC_MASK)

#define I2CIF_INTR_I2C_EC_MASKED_REG (*(reg32 *) I2CIF_SCB__INTR_I2C_EC_MASKED)
#define I2CIF_INTR_I2C_EC_MASKED_PTR ( (reg32 *) I2CIF_SCB__INTR_I2C_EC_MASKED)

#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_INTR_SPI_EC_REG        (*(reg32 *) I2CIF_SCB__INTR_SPI_EC)
    #define I2CIF_INTR_SPI_EC_PTR        ( (reg32 *) I2CIF_SCB__INTR_SPI_EC)

