tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
    #define I2CIF_INTR_SPI_EC_MASK_REG   (*(reg32 *) I2CIF_SCB__INTR_SPI_EC_MASK)
    #define I2CIF_INTR_SPI_EC_MASK_PTR   ( (reg32 *) I2CIF_SCB__INTR_SPI_EC_MASK)

    #define I2CIF_INTR_SPI_EC_MASKED_REG (*(reg32 *) I2CIF_SCB__INTR_SPI_EC_MASKED)
    #define I2CIF_INTR_SPI_EC_MASKED_PTR ( (reg32 *) I2CIF_SCB__INTR_SPI_EC_MASKED)
#endif /* (!I2CIF_CY_SCBIP_V1) */

#define I2CIF_INTR_MASTER_REG        (*(reg32 *) I2CIF_SCB__INTR_M)
#define I2CIF_INTR_MASTER_PTR        ( (reg32 *) I2CIF_SCB__INTR_M)

#define I2CIF_INTR_MASTER_SET_REG    (*(reg32 *) I2CIF_SCB__INTR_M_SET)
#define I2CIF_INTR_MASTER_SET_PTR    ( (reg32 *) I2CIF_SCB__INTR_M_SET)

#define I2CIF_INTR_MASTER_MASK_REG   (*(reg32 *) I2CIF_SCB__INTR_M_MASK)
#define I2CIF_INTR_MASTER_MASK_PTR   ( (reg32 *) I2CIF_SCB__INTR_M_MASK)

#define I2CIF_INTR_MASTER_MASKED_REG (*(reg32 *) I2CIF_SCB__INTR_M_MASKED)
#define I2CIF_INTR_MASTER_MASKED_PTR ( (reg32 *) I2CIF_SCB__INTR_M_MASKED)

#define I2CIF_INTR_SLAVE_REG         (*(reg32 *) I2CIF_SCB__INTR_S)
#define I2CIF_INTR_SLAVE_PTR         ( (reg32 *) I2CIF_SCB__INTR_S)

#define I2CIF_INTR_SLAVE_SET_REG     (*(reg32 *) I2CIF_SCB__INTR_S_SET)
#define I2CIF_INTR_SLAVE_SET_PTR     ( (reg32 *) I2CIF_SCB__INTR_S_SET)

#define I2CIF_INTR_SLAVE_MASK_REG    (*(reg32 *) I2CIF_SCB__INTR_S_MASK)
#define I2CIF_INTR_SLAVE_MASK_PTR    ( (reg32 *) I2CIF_SCB__INTR_S_MASK)

#define I2CIF_INTR_SLAVE_MASKED_REG  (*(reg32 *) I2CIF_SCB__INTR_S_MASKED)
#define I2CIF_INTR_SLAVE_MASKED_PTR  ( (reg32 *) I2CIF_SCB__INTR_S_MASKED)

#define I2CIF_INTR_TX_REG            (*(reg32 *) I2CIF_SCB__INTR_TX)
#define I2CIF_INTR_TX_PTR            ( (reg32 *) I2CIF_SCB__INTR_TX)

#define I2CIF_INTR_TX_SET_REG        (*(reg32 *) I2CIF_SCB__INTR_TX_SET)
#define I2CIF_INTR_TX_SET_PTR        ( (reg32 *) I2CIF_SCB__INTR_TX_SET)

#define I2CIF_INTR_TX_MASK_REG       (*(reg32 *) I2CIF_SCB__INTR_TX_MASK)
#define I2CIF_INTR_TX_MASK_PTR       ( (reg32 *) I2CIF_SCB__INTR_TX_MASK)

#define I2CIF_INTR_TX_MASKED_REG     (*(reg32 *) I2CIF_SCB__INTR_TX_MASKED)
#define I2CIF_INTR_TX_MASKED_PTR     ( (reg32 *) I2CIF_SCB__INTR_TX_MASKED)

#define I2CIF_INTR_RX_REG            (*(reg32 *) I2CIF_SCB__INTR_RX)
#define I2CIF_INTR_RX_PTR            ( (reg32 *) I2CIF_SCB__INTR_RX)

#define I2CIF_INTR_RX_SET_REG        (*(reg32 *) I2CIF_SCB__INTR_RX_SET)
#define I2CIF_INTR_RX_SET_PTR        ( (reg32 *) I2CIF_SCB__INTR_RX_SET)

#define I2CIF_INTR_RX_MASK_REG       (*(reg32 *) I2CIF_SCB__INTR_RX_MASK)
#define I2CIF_INTR_RX_MASK_PTR       ( (reg32 *) I2CIF_SCB__INTR_RX_MASK)

#define I2CIF_INTR_RX_MASKED_REG     (*(reg32 *) I2CIF_SCB__INTR_RX_MASKED)
#define I2CIF_INTR_RX_MASKED_PTR     ( (reg32 *) I2CIF_SCB__INTR_RX_MASKED)

#if (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_FF_DATA_NR_LOG2_PLUS1_MASK (0x0Fu) /* FF_DATA_NR_LOG2_PLUS1 = 4, MASK = 2^4 - 1 = 15 */
    #define I2CIF_FF_DATA_NR_LOG2_MASK       (0x07u) /* FF_DATA_NR_LOG2 = 3, MASK = 2^3 - 1 = 7 */
#else
    #define I2CIF_FF_DATA_NR_LOG2_PLUS1_MASK (0x1Fu) /* FF_DATA_NR_LOG2_PLUS1 = 5, MASK = 2^5 - 1 = 31 */
    #define I2CIF_FF_DATA_NR_LOG2_MASK       (0x0Fu) /* FF_DATA_NR_LOG2 = 4, MASK = 2^4 - 1 = 15 */
#endif /* (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */


/***************************************
*        Registers Constants
***************************************/

#if (I2CIF_SCB_IRQ_INTERNAL)
    #define I2CIF_ISR_NUMBER     ((uint8) I2CIF_SCB_IRQ__INTC_NUMBER)
    #define I2CIF_ISR_PRIORITY   ((uint8) I2CIF_SCB_IRQ__INTC_PRIOR_NUM)
#endif /* (I2CIF_SCB_IRQ_INTERNAL) */

#if (I2CIF_UART_RX_WAKEUP_IRQ)
    #define I2CIF_RX_WAKE_ISR_NUMBER     ((uint8) I2CIF_RX_WAKEUP_IRQ__INTC_NUMBER)
    #define I2CIF_RX_WAKE_ISR_PRIORITY   ((uint8) I2CIF_RX_WAKEUP_IRQ__INTC_PRIOR_NUM)
#endif /* (I2CIF_UART_RX_WAKEUP_IRQ) */

/* I2CIF_CTRL_REG */
#define I2CIF_CTRL_OVS_POS           (0u)  /* [3:0]   Oversampling factor                 */
#define I2CIF_CTRL_EC_AM_MODE_POS    (8u)  /* [8]     Externally clocked address match    */
#define I2CIF_CTRL_EC_OP_MODE_POS    (9u)  /* [9]     Externally clocked operation mode   */
#define I2CIF_CTRL_EZBUF_MODE_POS    (10u) /* [10]    EZ buffer is enabled                */
#if !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_CTRL_BYTE_MODE_POS (11u) /* [11]    Determines the number of bits per FIFO data element */
#endif /* !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */
#define I2CIF_CTRL_ADDR_ACCEPT_POS   (16u) /* [16]    Put matched address in RX FIFO       */
#define I2CIF_CTRL_BLOCK_POS         (17u) /* [17]    Ext and Int logic to resolve collide */
#define I2CIF_CTRL_MODE_POS          (24u) /* [25:24] Operation mode                       */
#define I2CIF_CTRL_ENABLED_POS       (31u) /* [31]    Enable SCB block                     */
#define I2CIF_CTRL_OVS_MASK          ((uint32) 0x0Fu)
#define I2CIF_CTRL_EC_AM_MODE        ((uint32) 0x01u << I2CIF_CTRL_EC_AM_MODE_POS)
#define I2CIF_CTRL_EC_OP_MODE        ((uint32) 0x01u << I2CIF_CTRL_EC_OP_MODE_POS)
#define I2CIF_CTRL_EZBUF_MODE        ((uint32) 0x01u << I2CIF_CTRL_EZBUF_MODE_POS)
#if !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_CTRL_BYTE_MODE ((uint32) 0x01u << I2CIF_CTRL_BYTE_MODE_POS)
#endif /* !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */
#define I2CIF_CTRL_ADDR_ACCEPT       ((uint32) 0x01u << I2CIF_CTRL_ADDR_ACCEPT_POS)
#define I2CIF_CTRL_BLOCK             ((uint32) 0x01u << I2CIF_CTRL_BLOCK_POS)
#define I2CIF_CTRL_MODE_MASK         ((uint32) 0x03u << I2CIF_CTRL_MODE_POS)
#define I2CIF_CTRL_MODE_I2C          ((uint32) 0x00u)
#define I2CIF_CTRL_MODE_SPI          ((uint32) 0x01u << I2CIF_CTRL_MODE_POS)
#define I2CIF_CTRL_MODE_UART         ((uint32) 0x02u << I2CIF_CTRL_MODE_POS)
#define I2CIF_CTRL_ENABLED           ((uint32) 0x01u << I2CIF_CTRL_ENABLED_POS)

/* I2CIF_STATUS_REG */
#define I2CIF_STATUS_EC_BUSY_POS     (0u)  /* [0] Bus busy. Externally clocked logic access to EZ memory */
#define I2CIF_STATUS_EC_BUSY         ((uint32) 0x0Fu)

/* I2CIF_SPI_CTRL_REG  */
#define I2CIF_SPI_CTRL_CONTINUOUS_POS        (0u)  /* [0]     Continuous or Separated SPI data transfers */
#define I2CIF_SPI_CTRL_SELECT_PRECEDE_POS    (1u)  /* [1]     Precedes or coincides start of data frame  */
#define I2CIF_SPI_CTRL_CPHA_POS              (2u)  /* [2]     SCLK phase                                 */
#define I2CIF_SPI_CTRL_CPOL_POS              (3u)  /* [3]     SCLK polarity                              */
#define I2CIF_SPI_CTRL_LATE_MISO_SAMPLE_POS  (4u)  /* [4]     Late MISO sample enabled                   */
#if !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_SPI_CTRL_SCLK_CONTINUOUS_POS   (5u)  /* [5]     Enable continuous SCLK generation */
    #define I2CIF_SPI_CTRL_SSEL0_POLARITY_POS    (8u)  /* [8]     SS0 polarity                      */
    #define I2CIF_SPI_CTRL_SSEL1_POLARITY_POS    (9u)  /* [9]     SS1 polarity                      */
    #define I2CIF_SPI_CTRL_SSEL2_POLARITY_POS    (10u) /* [10]    SS2 polarity                      */
    #define I2CIF_SPI_CTRL_SSEL3_POLARITY_POS    (11u) /* [11]    SS3 polarity                      */
#endif /* !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */
#define I2CIF_SPI_CTRL_LOOPBACK_POS          (16u) /* [16]    Local loop-back control enabled            */
#define I2CIF_SPI_CTRL_MODE_POS              (24u) /* [25:24] Submode of SPI operation                   */
#define I2CIF_SPI_CTRL_SLAVE_SELECT_POS      (26u) /* [27:26] Selects SPI SS signal                      */
#define I2CIF_SPI_CTRL_MASTER_MODE_POS       (31u) /* [31]    Master mode enabled                        */
#define I2CIF_SPI_CTRL_CONTINUOUS            ((uint32) 0x01u)
#define I2CIF_SPI_CTRL_SELECT_PRECEDE        ((uint32) 0x01u << I2CIF_SPI_CTRL_SELECT_PRECEDE_POS)
#define I2CIF_SPI_CTRL_SCLK_MODE_MASK        ((uint32) 0x03u << I2CIF_SPI_CTRL_CPHA_POS)
#define I2CIF_SPI_CTRL_CPHA                  ((uint32) 0x01u << I2CIF_SPI_CTRL_CPHA_POS)
#define I2CIF_SPI_CTRL_CPOL                  ((uint32) 0x01u << I2CIF_SPI_CTRL_CPOL_POS)
#define I2CIF_SPI_CTRL_LATE_MISO_SAMPLE      ((uint32) 0x01u << \
                                                                    I2CIF_SPI_CTRL_LATE_MISO_SAMPLE_POS)
#if !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_SPI_CTRL_SCLK_CONTINUOUS  ((uint32) 0x01u << I2CIF_SPI_CTRL_SCLK_CONTINUOUS_POS)
    #define I2CIF_SPI_CTRL_SSEL0_POLARITY   ((uint32) 0x01u << I2CIF_SPI_CTRL_SSEL0_POLARITY_POS)
    #define I2CIF_SPI_CTRL_SSEL1_POLARITY   ((uint32) 0x01u << I2CIF_SPI_CTRL_SSEL1_POLARITY_POS)
    #define I2CIF_SPI_CTRL_SSEL2_POLARITY   ((uint32) 0x01u << I2CIF_SPI_CTRL_SSEL2_POLARITY_POS)
    #define I2CIF_SPI_CTRL_SSEL3_POLARITY   ((uint32) 0x01u << I2CIF_SPI_CTRL_SSEL3_POLARITY_POS)
    #define I2CIF_SPI_CTRL_SSEL_POLARITY_MASK ((uint32)0x0Fu << I2CIF_SPI_CTRL_SSEL0_POLARITY_POS)
#endif /* !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */

#define I2CIF_SPI_CTRL_LOOPBACK              ((uint32) 0x01u << I2CIF_SPI_CTRL_LOOPBACK_POS)
#define I2CIF_SPI_CTRL_MODE_MASK             ((uint32) 0x03u << I2CIF_SPI_CTRL_MODE_POS)
#define I2CIF_SPI_CTRL_MODE_MOTOROLA         ((uint32) 0x00u)
#define I2CIF_SPI_CTRL_MODE_TI               ((uint32) 0x01u << I2CIF_CTRL_MODE_POS)
#define I2CIF_SPI_CTRL_MODE_NS               ((uint32) 0x02u << I2CIF_CTRL_MODE_POS)
#define I2CIF_SPI_CTRL_SLAVE_SELECT_MASK     ((uint32) 0x03u << I2CIF_SPI_CTRL_SLAVE_SELECT_POS)
#define I2CIF_SPI_CTRL_SLAVE_SELECT0         ((uint32) 0x00u)
#define I2CIF_SPI_CTRL_SLAVE_SELECT1         ((uint32) 0x01u << I2CIF_SPI_CTRL_SLAVE_SELECT_POS)
#define I2CIF_SPI_CTRL_SLAVE_SELECT2         ((uint32) 0x02u << I2CIF_SPI_CTRL_SLAVE_SELECT_POS)
#define I2CIF_SPI_CTRL_SLAVE_SELECT3         ((uint32) 0x03u << I2CIF_SPI_CTRL_SLAVE_SELECT_POS)
#define I2CIF_SPI_CTRL_MASTER                ((uint32) 0x01u << I2CIF_SPI_CTRL_MASTER_MODE_POS)
#define I2CIF_SPI_CTRL_SLAVE                 ((uint32) 0x00u)

/* I2CIF_SPI_STATUS_REG  */
#define I2CIF_SPI_STATUS_BUS_BUSY_POS    (0u)  /* [0]    Bus busy - slave selected */
#define I2CIF_SPI_STATUS_EZBUF_ADDR_POS  (8u)  /* [15:8] EzAddress                 */
#define I2CIF_SPI_STATUS_BUS_BUSY        ((uint32) 0x01u)
#define I2CIF_SPI_STATUS_EZBUF_ADDR_MASK ((uint32) 0xFFu << I2CIF_I2C_STATUS_EZBUF_ADDR_POS)

