tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
/* I2CIF_UART_CTRL */
#define I2CIF_UART_CTRL_LOOPBACK_POS         (16u) /* [16] Loop-back    */
#define I2CIF_UART_CTRL_MODE_POS             (24u) /* [24] UART subMode */
#define I2CIF_UART_CTRL_LOOPBACK             ((uint32) 0x01u << I2CIF_UART_CTRL_LOOPBACK_POS)
#define I2CIF_UART_CTRL_MODE_UART_STD        ((uint32) 0x00u)
#define I2CIF_UART_CTRL_MODE_UART_SMARTCARD  ((uint32) 0x01u << I2CIF_UART_CTRL_MODE_POS)
#define I2CIF_UART_CTRL_MODE_UART_IRDA       ((uint32) 0x02u << I2CIF_UART_CTRL_MODE_POS)
#define I2CIF_UART_CTRL_MODE_MASK            ((uint32) 0x03u << I2CIF_UART_CTRL_MODE_POS)

/* I2CIF_UART_TX_CTRL */
#define I2CIF_UART_TX_CTRL_STOP_BITS_POS         (0u)  /* [2:0] Stop bits: (Stop bits + 1) * 0.5 period */
#define I2CIF_UART_TX_CTRL_PARITY_POS            (4u)  /* [4]   Parity bit                              */
#define I2CIF_UART_TX_CTRL_PARITY_ENABLED_POS    (5u)  /* [5]   Parity enable                           */
#define I2CIF_UART_TX_CTRL_RETRY_ON_NACK_POS     (8u)  /* [8]   Smart Card: re-send frame on NACK       */
#define I2CIF_UART_TX_CTRL_ONE_STOP_BIT          ((uint32) 0x01u)
#define I2CIF_UART_TX_CTRL_ONE_HALF_STOP_BITS    ((uint32) 0x02u)
#define I2CIF_UART_TX_CTRL_TWO_STOP_BITS         ((uint32) 0x03u)
#define I2CIF_UART_TX_CTRL_STOP_BITS_MASK        ((uint32) 0x07u)
#define I2CIF_UART_TX_CTRL_PARITY                ((uint32) 0x01u << \
                                                                    I2CIF_UART_TX_CTRL_PARITY_POS)
#define I2CIF_UART_TX_CTRL_PARITY_ENABLED        ((uint32) 0x01u << \
                                                                    I2CIF_UART_TX_CTRL_PARITY_ENABLED_POS)
#define I2CIF_UART_TX_CTRL_RETRY_ON_NACK         ((uint32) 0x01u << \
                                                                    I2CIF_UART_TX_CTRL_RETRY_ON_NACK_POS)

/* I2CIF_UART_RX_CTRL */
#define I2CIF_UART_RX_CTRL_STOP_BITS_POS             (0u)  /* [2:0] Stop bits: (Stop bits + 1) * 0.5 period*/
#define I2CIF_UART_RX_CTRL_PARITY_POS                (4u)  /* [4]   Parity bit                             */
#define I2CIF_UART_RX_CTRL_PARITY_ENABLED_POS        (5u)  /* [5]   Parity enable                          */
#define I2CIF_UART_RX_CTRL_POLARITY_POS              (6u)  /* [6]   IrDA: inverts polarity of RX signal    */
#define I2CIF_UART_RX_CTRL_DROP_ON_PARITY_ERR_POS    (8u)  /* [8]   Drop and lost RX FIFO on parity error  */
#define I2CIF_UART_RX_CTRL_DROP_ON_FRAME_ERR_POS     (9u)  /* [9]   Drop and lost RX FIFO on frame error   */
#define I2CIF_UART_RX_CTRL_MP_MODE_POS               (10u) /* [10]  Multi-processor mode                   */
#define I2CIF_UART_RX_CTRL_LIN_MODE_POS              (12u) /* [12]  Lin mode: applicable for UART Standard */
#define I2CIF_UART_RX_CTRL_SKIP_START_POS            (13u) /* [13]  Skip start not: only for UART Standard */
#define I2CIF_UART_RX_CTRL_BREAK_WIDTH_POS           (16u) /* [19:16]  Break width: (Break width + 1)      */
#define I2CIF_UART_TX_CTRL_ONE_STOP_BIT              ((uint32) 0x01u)
#define I2CIF_UART_TX_CTRL_ONE_HALF_STOP_BITS        ((uint32) 0x02u)
#define I2CIF_UART_TX_CTRL_TWO_STOP_BITS             ((uint32) 0x03u)
#define I2CIF_UART_RX_CTRL_STOP_BITS_MASK            ((uint32) 0x07u)
#define I2CIF_UART_RX_CTRL_PARITY                    ((uint32) 0x01u << \
                                                                    I2CIF_UART_RX_CTRL_PARITY_POS)
#define I2CIF_UART_RX_CTRL_PARITY_ENABLED            ((uint32) 0x01u << \
                                                                    I2CIF_UART_RX_CTRL_PARITY_ENABLED_POS)
#define I2CIF_UART_RX_CTRL_POLARITY                  ((uint32) 0x01u << \
                                                                    I2CIF_UART_RX_CTRL_POLARITY_POS)
#define I2CIF_UART_RX_CTRL_DROP_ON_PARITY_ERR        ((uint32) 0x01u << \
                                                                   I2CIF_UART_RX_CTRL_DROP_ON_PARITY_ERR_POS)
#define I2CIF_UART_RX_CTRL_DROP_ON_FRAME_ERR         ((uint32) 0x01u << \
                                                                    I2CIF_UART_RX_CTRL_DROP_ON_FRAME_ERR_POS)
#define I2CIF_UART_RX_CTRL_MP_MODE                   ((uint32) 0x01u << \
                                                                    I2CIF_UART_RX_CTRL_MP_MODE_POS)
#define I2CIF_UART_RX_CTRL_LIN_MODE                  ((uint32) 0x01u << \
                                                                    I2CIF_UART_RX_CTRL_LIN_MODE_POS)
#define I2CIF_UART_RX_CTRL_SKIP_START                ((uint32) 0x01u << \
                                                                    I2CIF_UART_RX_CTRL_SKIP_START_POS)
#define I2CIF_UART_RX_CTRL_BREAK_WIDTH_MASK          ((uint32) 0x0Fu << \
                                                                    I2CIF_UART_RX_CTRL_BREAK_WIDTH_POS)
/* I2CIF_UART_RX_STATUS_REG */
#define I2CIF_UART_RX_STATUS_BR_COUNTER_POS     (0u)  /* [11:0] Baud Rate counter */
#define I2CIF_UART_RX_STATUS_BR_COUNTER_MASK    ((uint32) 0xFFFu)

#if !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    /* I2CIF_UART_FLOW_CTRL_REG */
    #define I2CIF_UART_FLOW_CTRL_TRIGGER_LEVEL_POS    (0u)  /* [7:0] RTS RX FIFO trigger level         */
    #define I2CIF_UART_FLOW_CTRL_RTS_POLARITY_POS     (16u) /* [16]  Polarity of the RTS output signal */
    #define I2CIF_UART_FLOW_CTRL_CTS_POLARITY_POS     (24u) /* [24]  Polarity of the CTS input signal  */
    #define I2CIF_UART_FLOW_CTRL_CTS_ENABLED_POS      (25u) /* [25]  Enable CTS signal                 */
    #define I2CIF_UART_FLOW_CTRL_TRIGGER_LEVEL_MASK   ((uint32) I2CIF_FF_DATA_NR_LOG2_MASK)
    #define I2CIF_UART_FLOW_CTRL_RTS_POLARITY         ((uint32) 0x01u << \
                                                                       I2CIF_UART_FLOW_CTRL_RTS_POLARITY_POS)
    #define I2CIF_UART_FLOW_CTRL_CTS_POLARITY         ((uint32) 0x01u << \
                                                                       I2CIF_UART_FLOW_CTRL_CTS_POLARITY_POS)
    #define I2CIF_UART_FLOW_CTRL_CTS_ENABLE           ((uint32) 0x01u << \
                                                                       I2CIF_UART_FLOW_CTRL_CTS_ENABLED_POS)
#endif /* !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */

/* I2CIF_I2C_CTRL */
#define I2CIF_I2C_CTRL_HIGH_PHASE_OVS_POS           (0u)   /* [3:0] Oversampling factor high: master only */
#define I2CIF_I2C_CTRL_LOW_PHASE_OVS_POS            (4u)   /* [7:4] Oversampling factor low:  master only */
#define I2CIF_I2C_CTRL_M_READY_DATA_ACK_POS         (8u)   /* [8]   Master ACKs data while RX FIFO != FULL*/
#define I2CIF_I2C_CTRL_M_NOT_READY_DATA_NACK_POS    (9u)   /* [9]   Master NACKs data if RX FIFO ==  FULL */
#define I2CIF_I2C_CTRL_S_GENERAL_IGNORE_POS         (11u)  /* [11]  Slave ignores General call            */
#define I2CIF_I2C_CTRL_S_READY_ADDR_ACK_POS         (12u)  /* [12]  Slave ACKs Address if RX FIFO != FULL */
#define I2CIF_I2C_CTRL_S_READY_DATA_ACK_POS         (13u)  /* [13]  Slave ACKs data while RX FIFO == FULL */
#define I2CIF_I2C_CTRL_S_NOT_READY_ADDR_NACK_POS    (14u)  /* [14]  Slave NACKs address if RX FIFO == FULL*/
#define I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK_POS    (15u)  /* [15]  Slave NACKs data if RX FIFO is  FULL  */
#define I2CIF_I2C_CTRL_LOOPBACK_POS                 (16u)  /* [16]  Loop-back                             */
#define I2CIF_I2C_CTRL_SLAVE_MODE_POS               (30u)  /* [30]  Slave mode enabled                    */
#define I2CIF_I2C_CTRL_MASTER_MODE_POS              (31u)  /* [31]  Master mode enabled                   */
#define I2CIF_I2C_CTRL_HIGH_PHASE_OVS_MASK  ((uint32) 0x0Fu)
#define I2CIF_I2C_CTRL_LOW_PHASE_OVS_MASK   ((uint32) 0x0Fu << \
                                                                I2CIF_I2C_CTRL_LOW_PHASE_OVS_POS)
#define I2CIF_I2C_CTRL_M_READY_DATA_ACK      ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_M_READY_DATA_ACK_POS)
#define I2CIF_I2C_CTRL_M_NOT_READY_DATA_NACK ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_M_NOT_READY_DATA_NACK_POS)
#define I2CIF_I2C_CTRL_S_GENERAL_IGNORE      ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_S_GENERAL_IGNORE_POS)
#define I2CIF_I2C_CTRL_S_READY_ADDR_ACK      ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_S_READY_ADDR_ACK_POS)
#define I2CIF_I2C_CTRL_S_READY_DATA_ACK      ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_S_READY_DATA_ACK_POS)
#define I2CIF_I2C_CTRL_S_NOT_READY_ADDR_NACK ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_S_NOT_READY_ADDR_NACK_POS)
#define I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK_POS)
#define I2CIF_I2C_CTRL_LOOPBACK              ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_LOOPBACK_POS)
#define I2CIF_I2C_CTRL_SLAVE_MODE            ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_SLAVE_MODE_POS)
#define I2CIF_I2C_CTRL_MASTER_MODE           ((uint32) 0x01u << \
                                                                I2CIF_I2C_CTRL_MASTER_MODE_POS)
#define I2CIF_I2C_CTRL_SLAVE_MASTER_MODE_MASK    ((uint32) 0x03u << \
                                                                I2CIF_I2C_CTRL_SLAVE_MODE_POS)

/* I2CIF_I2C_STATUS_REG  */
#define I2CIF_I2C_STATUS_BUS_BUSY_POS    (0u)  /* [0]    Bus busy: internally clocked */
#define I2CIF_I2C_STATUS_S_READ_POS      (4u)  /* [4]    Slave is read by master      */
#define I2CIF_I2C_STATUS_M_READ_POS      (5u)  /* [5]    Master reads Slave           */
#define I2CIF_I2C_STATUS_EZBUF_ADDR_POS  (8u)  /* [15:8] EZAddress                    */
#define I2CIF_I2C_STATUS_BUS_BUSY        ((uint32) 0x01u)
#define I2CIF_I2C_STATUS_S_READ          ((uint32) 0x01u << I2CIF_I2C_STATUS_S_READ_POS)
#define I2CIF_I2C_STATUS_M_READ          ((uint32) 0x01u << I2CIF_I2C_STATUS_M_READ_POS)
#define I2CIF_I2C_STATUS_EZBUF_ADDR_MASK ((uint32) 0xFFu << I2CIF_I2C_STATUS_EZBUF_ADDR_POS)

/* I2CIF_I2C_MASTER_CMD_REG */
#define I2CIF_I2C_MASTER_CMD_M_START_POS             (0u)  /* [0] Master generate Start                */
#define I2CIF_I2C_MASTER_CMD_M_START_ON_IDLE_POS     (1u)  /* [1] Master generate Start if bus is free */
#define I2CIF_I2C_MASTER_CMD_M_ACK_POS               (2u)  /* [2] Master generate ACK                  */
#define I2CIF_I2C_MASTER_CMD_M_NACK_POS              (3u)  /* [3] Master generate NACK                 */
#define I2CIF_I2C_MASTER_CMD_M_STOP_POS              (4u)  /* [4] Master generate Stop                 */
#define I2CIF_I2C_MASTER_CMD_M_START         ((uint32) 0x01u)
#define I2CIF_I2C_MASTER_CMD_M_START_ON_IDLE ((uint32) 0x01u << \
                                                                   I2CIF_I2C_MASTER_CMD_M_START_ON_IDLE_POS)
#define I2CIF_I2C_MASTER_CMD_M_ACK           ((uint32) 0x01u << \
                                                                   I2CIF_I2C_MASTER_CMD_M_ACK_POS)
#define I2CIF_I2C_MASTER_CMD_M_NACK          ((uint32) 0x01u << \
                                                                    I2CIF_I2C_MASTER_CMD_M_NACK_POS)
#define I2CIF_I2C_MASTER_CMD_M_STOP          ((uint32) 0x01u << \
                                                                    I2CIF_I2C_MASTER_CMD_M_STOP_POS)

/* I2CIF_I2C_SLAVE_CMD_REG  */
#define I2CIF_I2C_SLAVE_CMD_S_ACK_POS    (0u)  /* [0] Slave generate ACK  */
#define I2CIF_I2C_SLAVE_CMD_S_NACK_POS   (1u)  /* [1] Slave generate NACK */
#define I2CIF_I2C_SLAVE_CMD_S_ACK        ((uint32) 0x01u)
#define I2CIF_I2C_SLAVE_CMD_S_NACK       ((uint32) 0x01u << I2CIF_I2C_SLAVE_CMD_S_NACK_POS)

