tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
#define I2CIF_I2C_SLAVE_CMD_S_ACK_POS    (0u)  /* [0] Slave generate ACK  */
#define I2CIF_I2C_SLAVE_CMD_S_NACK_POS   (1u)  /* [1] Slave generate NACK */
#define I2CIF_I2C_SLAVE_CMD_S_ACK        ((uint32) 0x01u)
#define I2CIF_I2C_SLAVE_CMD_S_NACK       ((uint32) 0x01u << I2CIF_I2C_SLAVE_CMD_S_NACK_POS)

/* I2CIF_I2C_CFG_REG */
#if (I2CIF_CY_SCBIP_V0)
#define I2CIF_I2C_CFG_SDA_FILT_HYS_POS           (0u)  /* [1:0]   Trim bits for the I2C SDA filter         */
#define I2CIF_I2C_CFG_SDA_FILT_TRIM_POS          (2u)  /* [3:2]   Trim bits for the I2C SDA filter         */
#define I2CIF_I2C_CFG_SCL_FILT_HYS_POS           (4u)  /* [5:4]   Trim bits for the I2C SCL filter         */
#define I2CIF_I2C_CFG_SCL_FILT_TRIM_POS          (6u)  /* [7:6]   Trim bits for the I2C SCL filter         */
#define I2CIF_I2C_CFG_SDA_FILT_OUT_HYS_POS       (8u)  /* [9:8]   Trim bits for I2C SDA filter output path */
#define I2CIF_I2C_CFG_SDA_FILT_OUT_TRIM_POS      (10u) /* [11:10] Trim bits for I2C SDA filter output path */
#define I2CIF_I2C_CFG_SDA_FILT_HS_POS            (16u) /* [16]    '0': 50 ns filter, '1': 10 ns filter     */
#define I2CIF_I2C_CFG_SDA_FILT_ENABLED_POS       (17u) /* [17]    I2C SDA filter enabled                   */
#define I2CIF_I2C_CFG_SCL_FILT_HS_POS            (24u) /* [24]    '0': 50 ns filter, '1': 10 ns filter     */
#define I2CIF_I2C_CFG_SCL_FILT_ENABLED_POS       (25u) /* [25]    I2C SCL filter enabled                   */
#define I2CIF_I2C_CFG_SDA_FILT_OUT_HS_POS        (26u) /* [26]    '0': 50 ns filter, '1': 10 ns filter     */
#define I2CIF_I2C_CFG_SDA_FILT_OUT_ENABLED_POS   (27u) /* [27]    I2C SDA output delay filter enabled      */
#define I2CIF_I2C_CFG_SDA_FILT_HYS_MASK          ((uint32) 0x03u)
#define I2CIF_I2C_CFG_SDA_FILT_TRIM_MASK         ((uint32) 0x03u << \
                                                                I2CIF_I2C_CFG_SDA_FILT_TRIM_POS)
#define I2CIF_I2C_CFG_SCL_FILT_HYS_MASK          ((uint32) 0x03u << \
                                                                I2CIF_I2C_CFG_SCL_FILT_HYS_POS)
#define I2CIF_I2C_CFG_SCL_FILT_TRIM_MASK         ((uint32) 0x03u << \
                                                                I2CIF_I2C_CFG_SCL_FILT_TRIM_POS)
#define I2CIF_I2C_CFG_SDA_FILT_OUT_HYS_MASK      ((uint32) 0x03u << \
                                                                I2CIF_I2C_CFG_SDA_FILT_OUT_HYS_POS)
#define I2CIF_I2C_CFG_SDA_FILT_OUT_TRIM_MASK     ((uint32) 0x03u << \
                                                                I2CIF_I2C_CFG_SDA_FILT_OUT_TRIM_POS)
#define I2CIF_I2C_CFG_SDA_FILT_HS                ((uint32) 0x01u << \
                                                                I2CIF_I2C_CFG_SDA_FILT_HS_POS)
#define I2CIF_I2C_CFG_SDA_FILT_ENABLED           ((uint32) 0x01u << \
                                                                I2CIF_I2C_CFG_SDA_FILT_ENABLED_POS)
#define I2CIF_I2C_CFG_SCL_FILT_HS                ((uint32) 0x01u << \
                                                                I2CIF_I2C_CFG_SCL_FILT_HS_POS)
#define I2CIF_I2C_CFG_SCL_FILT_ENABLED           ((uint32) 0x01u << \
                                                                I2CIF_I2C_CFG_SCL_FILT_ENABLED_POS)
#define I2CIF_I2C_CFG_SDA_FILT_OUT_HS            ((uint32) 0x01u << \
                                                                I2CIF_I2C_CFG_SDA_FILT_OUT_HS_POS)
#define I2CIF_I2C_CFG_SDA_FILT_OUT_ENABLED       ((uint32) 0x01u << \
                                                                I2CIF_I2C_CFG_SDA_FILT_OUT_ENABLED_POS)
#else
#define I2CIF_I2C_CFG_SDA_IN_FILT_TRIM_POS   (0u)  /* [1:0] Trim bits for "i2c_sda_in" 50 ns filter */
#define I2CIF_I2C_CFG_SDA_IN_FILT_SEL_POS    (4u)  /* [4]   "i2c_sda_in" filter delay: 0 ns and 50 ns */
#define I2CIF_I2C_CFG_SCL_IN_FILT_TRIM_POS   (8u)  /* [9:8] Trim bits for "i2c_scl_in" 50 ns filter */
#define I2CIF_I2C_CFG_SCL_IN_FILT_SEL_POS    (12u) /* [12]  "i2c_scl_in" filter delay: 0 ns and 50 ns */
#define I2CIF_I2C_CFG_SDA_OUT_FILT0_TRIM_POS (16u) /* [17:16] Trim bits for "i2c_sda_out" 50 ns filter 0 */
#define I2CIF_I2C_CFG_SDA_OUT_FILT1_TRIM_POS (18u) /* [19:18] Trim bits for "i2c_sda_out" 50 ns filter 1 */
#define I2CIF_I2C_CFG_SDA_OUT_FILT2_TRIM_POS (20u) /* [21:20] Trim bits for "i2c_sda_out" 50 ns filter 2 */
#define I2CIF_I2C_CFG_SDA_OUT_FILT_SEL_POS   (28u) /* [29:28] Cumulative "i2c_sda_out" filter delay: */

#define I2CIF_I2C_CFG_SDA_IN_FILT_TRIM_MASK  ((uint32) 0x03u)
#define I2CIF_I2C_CFG_SDA_IN_FILT_SEL        ((uint32) 0x01u << I2CIF_I2C_CFG_SDA_IN_FILT_SEL_POS)
#define I2CIF_I2C_CFG_SCL_IN_FILT_TRIM_MASK  ((uint32) 0x03u << \
                                                            I2CIF_I2C_CFG_SCL_IN_FILT_TRIM_POS)
#define I2CIF_I2C_CFG_SCL_IN_FILT_SEL        ((uint32) 0x01u << I2CIF_I2C_CFG_SCL_IN_FILT_SEL_POS)
#define I2CIF_I2C_CFG_SDA_OUT_FILT0_TRIM_MASK ((uint32) 0x03u << \
                                                            I2CIF_I2C_CFG_SDA_OUT_FILT0_TRIM_POS)
#define I2CIF_I2C_CFG_SDA_OUT_FILT1_TRIM_MASK ((uint32) 0x03u << \
                                                            I2CIF_I2C_CFG_SDA_OUT_FILT1_TRIM_POS)
#define I2CIF_I2C_CFG_SDA_OUT_FILT2_TRIM_MASK ((uint32) 0x03u << \
                                                            I2CIF_I2C_CFG_SDA_OUT_FILT2_TRIM_POS)
#define I2CIF_I2C_CFG_SDA_OUT_FILT_SEL_MASK   ((uint32) 0x03u << \
                                                            I2CIF_I2C_CFG_SDA_OUT_FILT_SEL_POS)
#endif /* (I2CIF_CY_SCBIP_V0) */


/* I2CIF_TX_CTRL_REG */
#define I2CIF_TX_CTRL_DATA_WIDTH_POS     (0u)  /* [3:0] Data frame width: (Data width - 1) */
#define I2CIF_TX_CTRL_MSB_FIRST_POS      (8u)  /* [8]   MSB first shifter-out             */
#define I2CIF_TX_CTRL_ENABLED_POS        (31u) /* [31]  Transmitter enabled               */
#define I2CIF_TX_CTRL_DATA_WIDTH_MASK    ((uint32) 0x0Fu)
#define I2CIF_TX_CTRL_MSB_FIRST          ((uint32) 0x01u << I2CIF_TX_CTRL_MSB_FIRST_POS)
#define I2CIF_TX_CTRL_LSB_FIRST          ((uint32) 0x00u)
#define I2CIF_TX_CTRL_ENABLED            ((uint32) 0x01u << I2CIF_TX_CTRL_ENABLED_POS)

/* I2CIF_TX_CTRL_FIFO_REG */
#define I2CIF_TX_FIFO_CTRL_TRIGGER_LEVEL_POS     (0u)  /* [2:0] Trigger level                              */
#define I2CIF_TX_FIFO_CTRL_CLEAR_POS             (16u) /* [16]  Clear TX FIFO: cleared after set           */
#define I2CIF_TX_FIFO_CTRL_FREEZE_POS            (17u) /* [17]  Freeze TX FIFO: HW do not inc read pointer */
#define I2CIF_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK    ((uint32) I2CIF_FF_DATA_NR_LOG2_MASK)
#define I2CIF_TX_FIFO_CTRL_CLEAR                 ((uint32) 0x01u << I2CIF_TX_FIFO_CTRL_CLEAR_POS)
#define I2CIF_TX_FIFO_CTRL_FREEZE                ((uint32) 0x01u << I2CIF_TX_FIFO_CTRL_FREEZE_POS)

/* I2CIF_TX_FIFO_STATUS_REG */
#define I2CIF_TX_FIFO_STATUS_USED_POS    (0u)  /* [3:0]   Amount of entries in TX FIFO */
#define I2CIF_TX_FIFO_SR_VALID_POS       (15u) /* [15]    Shifter status of TX FIFO    */
#define I2CIF_TX_FIFO_STATUS_RD_PTR_POS  (16u) /* [18:16] TX FIFO read pointer         */
#define I2CIF_TX_FIFO_STATUS_WR_PTR_POS  (24u) /* [26:24] TX FIFO write pointer        */
#define I2CIF_TX_FIFO_STATUS_USED_MASK   ((uint32) I2CIF_FF_DATA_NR_LOG2_PLUS1_MASK)
#define I2CIF_TX_FIFO_SR_VALID           ((uint32) 0x01u << I2CIF_TX_FIFO_SR_VALID_POS)
#define I2CIF_TX_FIFO_STATUS_RD_PTR_MASK ((uint32) I2CIF_FF_DATA_NR_LOG2_MASK << \
                                                                    I2CIF_TX_FIFO_STATUS_RD_PTR_POS)
#define I2CIF_TX_FIFO_STATUS_WR_PTR_MASK ((uint32) I2CIF_FF_DATA_NR_LOG2_MASK << \
                                                                    I2CIF_TX_FIFO_STATUS_WR_PTR_POS)

/* I2CIF_TX_FIFO_WR_REG */
#define I2CIF_TX_FIFO_WR_POS    (0u)  /* [15:0] Data written into TX FIFO */
#define I2CIF_TX_FIFO_WR_MASK   ((uint32) 0xFFu)

/* I2CIF_RX_CTRL_REG */
#define I2CIF_RX_CTRL_DATA_WIDTH_POS     (0u)  /* [3:0] Data frame width: (Data width - 1) */
#define I2CIF_RX_CTRL_MSB_FIRST_POS      (8u)  /* [8]   MSB first shifter-out             */
#define I2CIF_RX_CTRL_MEDIAN_POS         (9u)  /* [9]   Median filter                     */
#define I2CIF_RX_CTRL_ENABLED_POS        (31u) /* [31]  Receiver enabled                  */
#define I2CIF_RX_CTRL_DATA_WIDTH_MASK    ((uint32) 0x0Fu)
#define I2CIF_RX_CTRL_MSB_FIRST          ((uint32) 0x01u << I2CIF_RX_CTRL_MSB_FIRST_POS)
#define I2CIF_RX_CTRL_LSB_FIRST          ((uint32) 0x00u)
#define I2CIF_RX_CTRL_MEDIAN             ((uint32) 0x01u << I2CIF_RX_CTRL_MEDIAN_POS)
#define I2CIF_RX_CTRL_ENABLED            ((uint32) 0x01u << I2CIF_RX_CTRL_ENABLED_POS)


/* I2CIF_RX_FIFO_CTRL_REG */
#define I2CIF_RX_FIFO_CTRL_TRIGGER_LEVEL_POS     (0u)   /* [2:0] Trigger level                            */
#define I2CIF_RX_FIFO_CTRL_CLEAR_POS             (16u)  /* [16]  Clear RX FIFO: clear after set           */
#define I2CIF_RX_FIFO_CTRL_FREEZE_POS            (17u)  /* [17]  Freeze RX FIFO: HW writes has not effect */
#define I2CIF_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK    ((uint32) I2CIF_FF_DATA_NR_LOG2_MASK)
#define I2CIF_RX_FIFO_CTRL_CLEAR                 ((uint32) 0x01u << I2CIF_RX_FIFO_CTRL_CLEAR_POS)
#define I2CIF_RX_FIFO_CTRL_FREEZE                ((uint32) 0x01u << I2CIF_RX_FIFO_CTRL_FREEZE_POS)

