tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
/* I2CIF_RX_FIFO_STATUS_REG */
#define I2CIF_RX_FIFO_STATUS_USED_POS    (0u)   /* [3:0]   Amount of entries in RX FIFO */
#define I2CIF_RX_FIFO_SR_VALID_POS       (15u)  /* [15]    Shifter status of RX FIFO    */
#define I2CIF_RX_FIFO_STATUS_RD_PTR_POS  (16u)  /* [18:16] RX FIFO read pointer         */
#define I2CIF_RX_FIFO_STATUS_WR_PTR_POS  (24u)  /* [26:24] RX FIFO write pointer        */
#define I2CIF_RX_FIFO_STATUS_USED_MASK   ((uint32) I2CIF_FF_DATA_NR_LOG2_PLUS1_MASK)
#define I2CIF_RX_FIFO_SR_VALID           ((uint32) 0x01u << I2CIF_RX_FIFO_SR_VALID_POS)
#define I2CIF_RX_FIFO_STATUS_RD_PTR_MASK ((uint32) I2CIF_FF_DATA_NR_LOG2_MASK << \
                                                                    I2CIF_RX_FIFO_STATUS_RD_PTR_POS)
#define I2CIF_RX_FIFO_STATUS_WR_PTR_MASK ((uint32) I2CIF_FF_DATA_NR_LOG2_MASK << \
                                                                    I2CIF_RX_FIFO_STATUS_WR_PTR_POS)

/* I2CIF_RX_MATCH_REG */
#define I2CIF_RX_MATCH_ADDR_POS     (0u)  /* [7:0]   Slave address                        */
#define I2CIF_RX_MATCH_MASK_POS     (16u) /* [23:16] Slave address mask: 0 - doesn't care */
#define I2CIF_RX_MATCH_ADDR_MASK    ((uint32) 0xFFu)
#define I2CIF_RX_MATCH_MASK_MASK    ((uint32) 0xFFu << I2CIF_RX_MATCH_MASK_POS)

/* I2CIF_RX_FIFO_WR_REG */
#define I2CIF_RX_FIFO_RD_POS    (0u)  /* [15:0] Data read from RX FIFO */
#define I2CIF_RX_FIFO_RD_MASK   ((uint32) 0xFFu)

/* I2CIF_RX_FIFO_RD_SILENT_REG */
#define I2CIF_RX_FIFO_RD_SILENT_POS     (0u)  /* [15:0] Data read from RX FIFO: not remove data from FIFO */
#define I2CIF_RX_FIFO_RD_SILENT_MASK    ((uint32) 0xFFu)

/* I2CIF_RX_FIFO_RD_SILENT_REG */
#define I2CIF_RX_FIFO_RD_SILENT_POS     (0u)  /* [15:0] Data read from RX FIFO: not remove data from FIFO */
#define I2CIF_RX_FIFO_RD_SILENT_MASK    ((uint32) 0xFFu)

/* I2CIF_EZBUF_DATA_REG */
#define I2CIF_EZBUF_DATA_POS   (0u)  /* [7:0] Data from EZ Memory */
#define I2CIF_EZBUF_DATA_MASK  ((uint32) 0xFFu)

/*  I2CIF_INTR_CAUSE_REG */
#define I2CIF_INTR_CAUSE_MASTER_POS  (0u)  /* [0] Master interrupt active                 */
#define I2CIF_INTR_CAUSE_SLAVE_POS   (1u)  /* [1] Slave interrupt active                  */
#define I2CIF_INTR_CAUSE_TX_POS      (2u)  /* [2] Transmitter interrupt active            */
#define I2CIF_INTR_CAUSE_RX_POS      (3u)  /* [3] Receiver interrupt active               */
#define I2CIF_INTR_CAUSE_I2C_EC_POS  (4u)  /* [4] Externally clock I2C interrupt active   */
#define I2CIF_INTR_CAUSE_SPI_EC_POS  (5u)  /* [5] Externally clocked SPI interrupt active */
#define I2CIF_INTR_CAUSE_MASTER      ((uint32) 0x01u)
#define I2CIF_INTR_CAUSE_SLAVE       ((uint32) 0x01u << I2CIF_INTR_CAUSE_SLAVE_POS)
#define I2CIF_INTR_CAUSE_TX          ((uint32) 0x01u << I2CIF_INTR_CAUSE_TX_POS)
#define I2CIF_INTR_CAUSE_RX          ((uint32) 0x01u << I2CIF_INTR_CAUSE_RX_POS)
#define I2CIF_INTR_CAUSE_I2C_EC      ((uint32) 0x01u << I2CIF_INTR_CAUSE_I2C_EC_POS)
#define I2CIF_INTR_CAUSE_SPI_EC      ((uint32) 0x01u << I2CIF_INTR_CAUSE_SPI_EC_POS)

/* I2CIF_INTR_SPI_EC_REG, I2CIF_INTR_SPI_EC_MASK_REG, I2CIF_INTR_SPI_EC_MASKED_REG */
#define I2CIF_INTR_SPI_EC_WAKE_UP_POS          (0u)  /* [0] Address match: triggers wakeup of chip */
#define I2CIF_INTR_SPI_EC_EZBUF_STOP_POS       (1u)  /* [1] Externally clocked Stop detected       */
#define I2CIF_INTR_SPI_EC_EZBUF_WRITE_STOP_POS (2u)  /* [2] Externally clocked Write Stop detected */
#define I2CIF_INTR_SPI_EC_WAKE_UP              ((uint32) 0x01u)
#define I2CIF_INTR_SPI_EC_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SPI_EC_EZBUF_STOP_POS)
#define I2CIF_INTR_SPI_EC_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SPI_EC_EZBUF_WRITE_STOP_POS)

/* I2CIF_INTR_I2C_EC, I2CIF_INTR_I2C_EC_MASK, I2CIF_INTR_I2C_EC_MASKED */
#define I2CIF_INTR_I2C_EC_WAKE_UP_POS          (0u)  /* [0] Address match: triggers wakeup of chip */
#define I2CIF_INTR_I2C_EC_EZBUF_STOP_POS       (1u)  /* [1] Externally clocked Stop detected       */
#define I2CIF_INTR_I2C_EC_EZBUF_WRITE_STOP_POS (2u)  /* [2] Externally clocked Write Stop detected */
#define I2CIF_INTR_I2C_EC_WAKE_UP              ((uint32) 0x01u)
#define I2CIF_INTR_I2C_EC_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    I2CIF_INTR_I2C_EC_EZBUF_STOP_POS)
#define I2CIF_INTR_I2C_EC_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                    I2CIF_INTR_I2C_EC_EZBUF_WRITE_STOP_POS)

/* I2CIF_INTR_MASTER, I2CIF_INTR_MASTER_SET,
   I2CIF_INTR_MASTER_MASK, I2CIF_INTR_MASTER_MASKED */
#define I2CIF_INTR_MASTER_I2C_ARB_LOST_POS   (0u)  /* [0] Master lost arbitration                          */
#define I2CIF_INTR_MASTER_I2C_NACK_POS       (1u)  /* [1] Master receives NACK: address or write to slave  */
#define I2CIF_INTR_MASTER_I2C_ACK_POS        (2u)  /* [2] Master receives NACK: address or write to slave  */
#define I2CIF_INTR_MASTER_I2C_STOP_POS       (4u)  /* [4] Master detects the Stop: only self generated Stop*/
#define I2CIF_INTR_MASTER_I2C_BUS_ERROR_POS  (8u)  /* [8] Master detects bus error: misplaced Start or Stop*/
#define I2CIF_INTR_MASTER_SPI_DONE_POS       (9u)  /* [9] Master complete transfer: Only for SPI           */
#define I2CIF_INTR_MASTER_I2C_ARB_LOST       ((uint32) 0x01u)
#define I2CIF_INTR_MASTER_I2C_NACK           ((uint32) 0x01u << I2CIF_INTR_MASTER_I2C_NACK_POS)
#define I2CIF_INTR_MASTER_I2C_ACK            ((uint32) 0x01u << I2CIF_INTR_MASTER_I2C_ACK_POS)
#define I2CIF_INTR_MASTER_I2C_STOP           ((uint32) 0x01u << I2CIF_INTR_MASTER_I2C_STOP_POS)
#define I2CIF_INTR_MASTER_I2C_BUS_ERROR      ((uint32) 0x01u << \
                                                                    I2CIF_INTR_MASTER_I2C_BUS_ERROR_POS)
#define I2CIF_INTR_MASTER_SPI_DONE           ((uint32) 0x01u << I2CIF_INTR_MASTER_SPI_DONE_POS)

