tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
/*
* I2CIF_INTR_SLAVE, I2CIF_INTR_SLAVE_SET,
* I2CIF_INTR_SLAVE_MASK, I2CIF_INTR_SLAVE_MASKED
*/
#define I2CIF_INTR_SLAVE_I2C_ARB_LOST_POS         (0u)  /* [0]  Slave lost arbitration                   */
#define I2CIF_INTR_SLAVE_I2C_NACK_POS             (1u)  /* [1]  Slave receives NACK: master reads data   */
#define I2CIF_INTR_SLAVE_I2C_ACK_POS              (2u)  /* [2]  Slave receives ACK: master reads data    */
#define I2CIF_INTR_SLAVE_I2C_WRITE_STOP_POS       (3u)  /* [3]  Slave detects end of write transaction   */
#define I2CIF_INTR_SLAVE_I2C_STOP_POS             (4u)  /* [4]  Slave detects end of transaction intended */
#define I2CIF_INTR_SLAVE_I2C_START_POS            (5u)  /* [5]  Slave detects Start                      */
#define I2CIF_INTR_SLAVE_I2C_ADDR_MATCH_POS       (6u)  /* [6]  Slave address matches                    */
#define I2CIF_INTR_SLAVE_I2C_GENERAL_POS          (7u)  /* [7]  General call received                    */
#define I2CIF_INTR_SLAVE_I2C_BUS_ERROR_POS        (8u)  /* [8]  Slave detects bus error                  */
#define I2CIF_INTR_SLAVE_SPI_EZBUF_WRITE_STOP_POS (9u)  /* [9]  Slave write complete: Only for SPI       */
#define I2CIF_INTR_SLAVE_SPI_EZBUF_STOP_POS       (10u) /* [10] Slave end of transaction: Only for SPI   */
#define I2CIF_INTR_SLAVE_SPI_BUS_ERROR_POS        (11u) /* [11] Slave detects bus error: Only for SPI    */
#define I2CIF_INTR_SLAVE_I2C_ARB_LOST             ((uint32) 0x01u)
#define I2CIF_INTR_SLAVE_I2C_NACK                 ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_I2C_NACK_POS)
#define I2CIF_INTR_SLAVE_I2C_ACK                  ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_I2C_ACK_POS)
#define I2CIF_INTR_SLAVE_I2C_WRITE_STOP           ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_I2C_WRITE_STOP_POS)
#define I2CIF_INTR_SLAVE_I2C_STOP                 ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_I2C_STOP_POS)
#define I2CIF_INTR_SLAVE_I2C_START                ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_I2C_START_POS)
#define I2CIF_INTR_SLAVE_I2C_ADDR_MATCH           ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_I2C_ADDR_MATCH_POS)
#define I2CIF_INTR_SLAVE_I2C_GENERAL              ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_I2C_GENERAL_POS)
#define I2CIF_INTR_SLAVE_I2C_BUS_ERROR            ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_I2C_BUS_ERROR_POS)
#define I2CIF_INTR_SLAVE_SPI_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                   I2CIF_INTR_SLAVE_SPI_EZBUF_WRITE_STOP_POS)
#define I2CIF_INTR_SLAVE_SPI_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_SPI_EZBUF_STOP_POS)
#define I2CIF_INTR_SLAVE_SPI_BUS_ERROR           ((uint32) 0x01u << \
                                                                    I2CIF_INTR_SLAVE_SPI_BUS_ERROR_POS)

/*
* I2CIF_INTR_TX, I2CIF_INTR_TX_SET,
* I2CIF_INTR_TX_MASK, I2CIF_INTR_TX_MASKED
*/
#define I2CIF_INTR_TX_TRIGGER_POS        (0u)  /* [0]  Trigger on TX FIFO entires                       */
#define I2CIF_INTR_TX_NOT_FULL_POS       (1u)  /* [1]  TX FIFO is not full                              */
#define I2CIF_INTR_TX_EMPTY_POS          (4u)  /* [4]  TX FIFO is empty                                 */
#define I2CIF_INTR_TX_OVERFLOW_POS       (5u)  /* [5]  Attempt to write to a full TX FIFO               */
#define I2CIF_INTR_TX_UNDERFLOW_POS      (6u)  /* [6]  Attempt to read from an empty TX FIFO            */
#define I2CIF_INTR_TX_BLOCKED_POS        (7u)  /* [7]  No access to the EZ memory                       */
#define I2CIF_INTR_TX_UART_NACK_POS      (8u)  /* [8]  UART transmitter received a NACK: SmartCard mode */
#define I2CIF_INTR_TX_UART_DONE_POS      (9u)  /* [9]  UART transmitter done even                       */
#define I2CIF_INTR_TX_UART_ARB_LOST_POS  (10u) /* [10] UART lost arbitration: LIN or SmartCard          */
#define I2CIF_INTR_TX_TRIGGER            ((uint32) 0x01u)
#define I2CIF_INTR_TX_FIFO_LEVEL         (I2CIF_INTR_TX_TRIGGER)
#define I2CIF_INTR_TX_NOT_FULL           ((uint32) 0x01u << I2CIF_INTR_TX_NOT_FULL_POS)
#define I2CIF_INTR_TX_EMPTY              ((uint32) 0x01u << I2CIF_INTR_TX_EMPTY_POS)
#define I2CIF_INTR_TX_OVERFLOW           ((uint32) 0x01u << I2CIF_INTR_TX_OVERFLOW_POS)
#define I2CIF_INTR_TX_UNDERFLOW          ((uint32) 0x01u << I2CIF_INTR_TX_UNDERFLOW_POS)
#define I2CIF_INTR_TX_BLOCKED            ((uint32) 0x01u << I2CIF_INTR_TX_BLOCKED_POS)
#define I2CIF_INTR_TX_UART_NACK          ((uint32) 0x01u << I2CIF_INTR_TX_UART_NACK_POS)
#define I2CIF_INTR_TX_UART_DONE          ((uint32) 0x01u << I2CIF_INTR_TX_UART_DONE_POS)
#define I2CIF_INTR_TX_UART_ARB_LOST      ((uint32) 0x01u << I2CIF_INTR_TX_UART_ARB_LOST_POS)

/*
* I2CIF_INTR_RX, I2CIF_INTR_RX_SET,
* I2CIF_INTR_RX_MASK, I2CIF_INTR_RX_MASKED
*/
#define I2CIF_INTR_RX_TRIGGER_POS        (0u)   /* [0]  Trigger on RX FIFO entires            */
#define I2CIF_INTR_RX_NOT_EMPTY_POS      (2u)   /* [2]  RX FIFO is not empty                  */
#define I2CIF_INTR_RX_FULL_POS           (3u)   /* [3]  RX FIFO is full                       */
#define I2CIF_INTR_RX_OVERFLOW_POS       (5u)   /* [5]  Attempt to write to a full RX FIFO    */
#define I2CIF_INTR_RX_UNDERFLOW_POS      (6u)   /* [6]  Attempt to read from an empty RX FIFO */
#define I2CIF_INTR_RX_BLOCKED_POS        (7u)   /* [7]  No access to the EZ memory            */
#define I2CIF_INTR_RX_FRAME_ERROR_POS    (8u)   /* [8]  Frame error in received data frame    */
#define I2CIF_INTR_RX_PARITY_ERROR_POS   (9u)   /* [9]  Parity error in received data frame   */
#define I2CIF_INTR_RX_BAUD_DETECT_POS    (10u)  /* [10] LIN baud rate detection is completed   */
#define I2CIF_INTR_RX_BREAK_DETECT_POS   (11u)  /* [11] Break detection is successful         */
#define I2CIF_INTR_RX_TRIGGER            ((uint32) 0x01u)
#define I2CIF_INTR_RX_FIFO_LEVEL         (I2CIF_INTR_RX_TRIGGER)
#define I2CIF_INTR_RX_NOT_EMPTY          ((uint32) 0x01u << I2CIF_INTR_RX_NOT_EMPTY_POS)
#define I2CIF_INTR_RX_FULL               ((uint32) 0x01u << I2CIF_INTR_RX_FULL_POS)
#define I2CIF_INTR_RX_OVERFLOW           ((uint32) 0x01u << I2CIF_INTR_RX_OVERFLOW_POS)
#define I2CIF_INTR_RX_UNDERFLOW          ((uint32) 0x01u << I2CIF_INTR_RX_UNDERFLOW_POS)
#define I2CIF_INTR_RX_BLOCKED            ((uint32) 0x01u << I2CIF_INTR_RX_BLOCKED_POS)
#define I2CIF_INTR_RX_FRAME_ERROR        ((uint32) 0x01u << I2CIF_INTR_RX_FRAME_ERROR_POS)
#define I2CIF_INTR_RX_PARITY_ERROR       ((uint32) 0x01u << I2CIF_INTR_RX_PARITY_ERROR_POS)
#define I2CIF_INTR_RX_BAUD_DETECT        ((uint32) 0x01u << I2CIF_INTR_RX_BAUD_DETECT_POS)
#define I2CIF_INTR_RX_BREAK_DETECT       ((uint32) 0x01u << I2CIF_INTR_RX_BREAK_DETECT_POS)

/* Define all interrupt sources */
#define I2CIF_INTR_I2C_EC_ALL    (I2CIF_INTR_I2C_EC_WAKE_UP    | \
                                             I2CIF_INTR_I2C_EC_EZBUF_STOP | \
                                             I2CIF_INTR_I2C_EC_EZBUF_WRITE_STOP)

