tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
#define I2CIF_INTR_SPI_EC_ALL    (I2CIF_INTR_SPI_EC_WAKE_UP    | \
                                             I2CIF_INTR_SPI_EC_EZBUF_STOP | \
                                             I2CIF_INTR_SPI_EC_EZBUF_WRITE_STOP)

#define I2CIF_INTR_MASTER_ALL    (I2CIF_INTR_MASTER_I2C_ARB_LOST  | \
                                             I2CIF_INTR_MASTER_I2C_NACK      | \
                                             I2CIF_INTR_MASTER_I2C_ACK       | \
                                             I2CIF_INTR_MASTER_I2C_STOP      | \
                                             I2CIF_INTR_MASTER_I2C_BUS_ERROR | \
                                             I2CIF_INTR_MASTER_SPI_DONE)

#define I2CIF_INTR_SLAVE_ALL     (I2CIF_INTR_SLAVE_I2C_ARB_LOST      | \
                                             I2CIF_INTR_SLAVE_I2C_NACK          | \
                                             I2CIF_INTR_SLAVE_I2C_ACK           | \
                                             I2CIF_INTR_SLAVE_I2C_WRITE_STOP    | \
                                             I2CIF_INTR_SLAVE_I2C_STOP          | \
                                             I2CIF_INTR_SLAVE_I2C_START         | \
                                             I2CIF_INTR_SLAVE_I2C_ADDR_MATCH    | \
                                             I2CIF_INTR_SLAVE_I2C_GENERAL       | \
                                             I2CIF_INTR_SLAVE_I2C_BUS_ERROR     | \
                                             I2CIF_INTR_SLAVE_SPI_EZBUF_WRITE_STOP | \
                                             I2CIF_INTR_SLAVE_SPI_EZBUF_STOP       | \
                                             I2CIF_INTR_SLAVE_SPI_BUS_ERROR)

#define I2CIF_INTR_TX_ALL        (I2CIF_INTR_TX_TRIGGER   | \
                                             I2CIF_INTR_TX_NOT_FULL  | \
                                             I2CIF_INTR_TX_EMPTY     | \
                                             I2CIF_INTR_TX_OVERFLOW  | \
                                             I2CIF_INTR_TX_UNDERFLOW | \
                                             I2CIF_INTR_TX_BLOCKED   | \
                                             I2CIF_INTR_TX_UART_NACK | \
                                             I2CIF_INTR_TX_UART_DONE | \
                                             I2CIF_INTR_TX_UART_ARB_LOST)

#define I2CIF_INTR_RX_ALL        (I2CIF_INTR_RX_TRIGGER      | \
                                             I2CIF_INTR_RX_NOT_EMPTY    | \
                                             I2CIF_INTR_RX_FULL         | \
                                             I2CIF_INTR_RX_OVERFLOW     | \
                                             I2CIF_INTR_RX_UNDERFLOW    | \
                                             I2CIF_INTR_RX_BLOCKED      | \
                                             I2CIF_INTR_RX_FRAME_ERROR  | \
                                             I2CIF_INTR_RX_PARITY_ERROR | \
                                             I2CIF_INTR_RX_BAUD_DETECT  | \
                                             I2CIF_INTR_RX_BREAK_DETECT)

/* General usage HW definitions */
#define I2CIF_ONE_BYTE_WIDTH (8u)   /* Number of bits in one byte           */
#define I2CIF_FIFO_SIZE      (8u)   /* Size of TX or RX FIFO: defined by HW */
#define I2CIF_EZBUFFER_SIZE  (32u)  /* EZ Buffer size: defined by HW        */

/* I2C and EZI2C slave address defines */
#define I2CIF_I2C_SLAVE_ADDR_POS    (0x01u)    /* 7-bit address shift */
#define I2CIF_I2C_SLAVE_ADDR_MASK   (0xFEu)    /* 8-bit address mask */

/* OVS constants for IrDA Low Power operation */
#define I2CIF_CTRL_OVS_IRDA_LP_OVS16     (0x00u)
#define I2CIF_CTRL_OVS_IRDA_LP_OVS32     (0x01u)
#define I2CIF_CTRL_OVS_IRDA_LP_OVS48     (0x02u)
#define I2CIF_CTRL_OVS_IRDA_LP_OVS96     (0x03u)
#define I2CIF_CTRL_OVS_IRDA_LP_OVS192    (0x04u)
#define I2CIF_CTRL_OVS_IRDA_LP_OVS768    (0x05u)
#define I2CIF_CTRL_OVS_IRDA_LP_OVS1536   (0x06u)

/* OVS constant for IrDA */
#define I2CIF_CTRL_OVS_IRDA_OVS16        (I2CIF_UART_IRDA_LP_OVS16)


/***************************************
*    Common Macro Definitions
***************************************/

/* Re-enables the SCB IP. A clear enable bit has a different effect
* on the scb IP depending on the version:
*  CY_SCBIP_V0: resets state, status, TX and RX FIFOs.
*  CY_SCBIP_V1 or later: resets state, status, TX and RX FIFOs and interrupt sources.
*/
#define I2CIF_SCB_SW_RESET \
                        do{           \
                            I2CIF_CTRL_REG &= ((uint32) ~I2CIF_CTRL_ENABLED); \
                            I2CIF_CTRL_REG |= ((uint32)  I2CIF_CTRL_ENABLED); \
                        }while(0)

/* TX FIFO macro */
#define I2CIF_CLEAR_TX_FIFO \
                            do{        \
                                I2CIF_TX_FIFO_CTRL_REG |= ((uint32)  I2CIF_TX_FIFO_CTRL_CLEAR); \
                                I2CIF_TX_FIFO_CTRL_REG &= ((uint32) ~I2CIF_TX_FIFO_CTRL_CLEAR); \
                            }while(0)

#define I2CIF_GET_TX_FIFO_ENTRIES    (I2CIF_TX_FIFO_STATUS_REG & \
                                                 I2CIF_TX_FIFO_STATUS_USED_MASK)

#define I2CIF_GET_TX_FIFO_SR_VALID   ((0u != (I2CIF_TX_FIFO_STATUS_REG & \
                                                         I2CIF_TX_FIFO_SR_VALID)) ? (1u) : (0u))

/* RX FIFO macro */
#define I2CIF_CLEAR_RX_FIFO \
                            do{        \
                                I2CIF_RX_FIFO_CTRL_REG |= ((uint32)  I2CIF_RX_FIFO_CTRL_CLEAR); \
                                I2CIF_RX_FIFO_CTRL_REG &= ((uint32) ~I2CIF_RX_FIFO_CTRL_CLEAR); \
                            }while(0)

#define I2CIF_GET_RX_FIFO_ENTRIES    (I2CIF_RX_FIFO_STATUS_REG & \
                                                    I2CIF_RX_FIFO_STATUS_USED_MASK)

#define I2CIF_GET_RX_FIFO_SR_VALID   ((0u != (I2CIF_RX_FIFO_STATUS_REG & \
                                                         I2CIF_RX_FIFO_SR_VALID)) ? (1u) : (0u))

