tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
/* Write interrupt source: set sourceMask bits in I2CIF_INTR_X_MASK_REG */
#define I2CIF_WRITE_INTR_I2C_EC_MASK(sourceMask) \
                                                do{         \
                                                    I2CIF_INTR_I2C_EC_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_WRITE_INTR_SPI_EC_MASK(sourceMask) \
                                                do{         \
                                                    I2CIF_INTR_SPI_EC_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!I2CIF_CY_SCBIP_V1) */

#define I2CIF_WRITE_INTR_MASTER_MASK(sourceMask) \
                                                do{         \
                                                    I2CIF_INTR_MASTER_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_WRITE_INTR_SLAVE_MASK(sourceMask)  \
                                                do{         \
                                                    I2CIF_INTR_SLAVE_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_WRITE_INTR_TX_MASK(sourceMask)     \
                                                do{         \
                                                    I2CIF_INTR_TX_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_WRITE_INTR_RX_MASK(sourceMask)     \
                                                do{         \
                                                    I2CIF_INTR_RX_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

/* Enable interrupt source: set sourceMask bits in I2CIF_INTR_X_MASK_REG */
#define I2CIF_ENABLE_INTR_I2C_EC(sourceMask) \
                                                do{     \
                                                    I2CIF_INTR_I2C_EC_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)
#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_ENABLE_INTR_SPI_EC(sourceMask) \
                                                do{     \
                                                    I2CIF_INTR_SPI_EC_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!I2CIF_CY_SCBIP_V1) */

#define I2CIF_ENABLE_INTR_MASTER(sourceMask) \
                                                do{     \
                                                    I2CIF_INTR_MASTER_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_ENABLE_INTR_SLAVE(sourceMask)  \
                                                do{     \
                                                    I2CIF_INTR_SLAVE_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_ENABLE_INTR_TX(sourceMask)     \
                                                do{     \
                                                    I2CIF_INTR_TX_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_ENABLE_INTR_RX(sourceMask)     \
                                                do{     \
                                                    I2CIF_INTR_RX_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

/* Disable interrupt source: clear sourceMask bits in I2CIF_INTR_X_MASK_REG */
#define I2CIF_DISABLE_INTR_I2C_EC(sourceMask) \
                                do{                      \
                                    I2CIF_INTR_I2C_EC_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_DISABLE_INTR_SPI_EC(sourceMask) \
                                do{                      \
                                    I2CIF_INTR_SPI_EC_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                 }while(0)
#endif /* (!I2CIF_CY_SCBIP_V1) */

#define I2CIF_DISABLE_INTR_MASTER(sourceMask) \
                                do{                      \
                                I2CIF_INTR_MASTER_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#define I2CIF_DISABLE_INTR_SLAVE(sourceMask) \
                                do{                     \
                                    I2CIF_INTR_SLAVE_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#define I2CIF_DISABLE_INTR_TX(sourceMask)    \
                                do{                     \
                                    I2CIF_INTR_TX_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                 }while(0)

#define I2CIF_DISABLE_INTR_RX(sourceMask)    \
                                do{                     \
                                    I2CIF_INTR_RX_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

/* Set interrupt sources: write sourceMask bits in I2CIF_INTR_X_SET_REG */
#define I2CIF_SET_INTR_MASTER(sourceMask)    \
                                                do{     \
                                                    I2CIF_INTR_MASTER_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_SET_INTR_SLAVE(sourceMask) \
                                                do{ \
                                                    I2CIF_INTR_SLAVE_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_SET_INTR_TX(sourceMask)    \
                                                do{ \
                                                    I2CIF_INTR_TX_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_SET_INTR_RX(sourceMask)    \
                                                do{ \
                                                    I2CIF_INTR_RX_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

/* Clear interrupt sources: write sourceMask bits in I2CIF_INTR_X_REG */
#define I2CIF_CLEAR_INTR_I2C_EC(sourceMask)  \
                                                do{     \
                                                    I2CIF_INTR_I2C_EC_REG = (uint32) (sourceMask); \
                                                }while(0)

#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_CLEAR_INTR_SPI_EC(sourceMask)  \
                                                do{     \
                                                    I2CIF_INTR_SPI_EC_REG = (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!I2CIF_CY_SCBIP_V1) */

#define I2CIF_CLEAR_INTR_MASTER(sourceMask)  \
                                                do{     \
                                                    I2CIF_INTR_MASTER_REG = (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_CLEAR_INTR_SLAVE(sourceMask)   \
                                                do{     \
                                                    I2CIF_INTR_SLAVE_REG  = (uint32) (sourceMask); \
                                                }while(0)

