tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
#define I2CIF_CLEAR_INTR_TX(sourceMask)      \
                                                do{     \
                                                    I2CIF_INTR_TX_REG     = (uint32) (sourceMask); \
                                                }while(0)

#define I2CIF_CLEAR_INTR_RX(sourceMask)      \
                                                do{     \
                                                    I2CIF_INTR_RX_REG     = (uint32) (sourceMask); \
                                                }while(0)

/* Return true if sourceMask is set in I2CIF_INTR_CAUSE_REG */
#define I2CIF_CHECK_CAUSE_INTR(sourceMask)    (0u != (I2CIF_INTR_CAUSE_REG & (sourceMask)))

/* Return true if sourceMask is set in INTR_X_MASKED_REG */
#define I2CIF_CHECK_INTR_I2C_EC(sourceMask)  (0u != (I2CIF_INTR_I2C_EC_REG & (sourceMask)))
#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_CHECK_INTR_SPI_EC(sourceMask)  (0u != (I2CIF_INTR_SPI_EC_REG & (sourceMask)))
#endif /* (!I2CIF_CY_SCBIP_V1) */
#define I2CIF_CHECK_INTR_MASTER(sourceMask)  (0u != (I2CIF_INTR_MASTER_REG & (sourceMask)))
#define I2CIF_CHECK_INTR_SLAVE(sourceMask)   (0u != (I2CIF_INTR_SLAVE_REG  & (sourceMask)))
#define I2CIF_CHECK_INTR_TX(sourceMask)      (0u != (I2CIF_INTR_TX_REG     & (sourceMask)))
#define I2CIF_CHECK_INTR_RX(sourceMask)      (0u != (I2CIF_INTR_RX_REG     & (sourceMask)))

/* Return true if sourceMask is set in I2CIF_INTR_X_MASKED_REG */
#define I2CIF_CHECK_INTR_I2C_EC_MASKED(sourceMask)   (0u != (I2CIF_INTR_I2C_EC_MASKED_REG & \
                                                                       (sourceMask)))
#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_CHECK_INTR_SPI_EC_MASKED(sourceMask)   (0u != (I2CIF_INTR_SPI_EC_MASKED_REG & \
                                                                       (sourceMask)))
#endif /* (!I2CIF_CY_SCBIP_V1) */
#define I2CIF_CHECK_INTR_MASTER_MASKED(sourceMask)   (0u != (I2CIF_INTR_MASTER_MASKED_REG & \
                                                                       (sourceMask)))
#define I2CIF_CHECK_INTR_SLAVE_MASKED(sourceMask)    (0u != (I2CIF_INTR_SLAVE_MASKED_REG  & \
                                                                       (sourceMask)))
#define I2CIF_CHECK_INTR_TX_MASKED(sourceMask)       (0u != (I2CIF_INTR_TX_MASKED_REG     & \
                                                                       (sourceMask)))
#define I2CIF_CHECK_INTR_RX_MASKED(sourceMask)       (0u != (I2CIF_INTR_RX_MASKED_REG     & \
                                                                       (sourceMask)))

/* Return true if sourceMask is set in I2CIF_CTRL_REG: generally is used to check enable bit */
#define I2CIF_GET_CTRL_ENABLED    (0u != (I2CIF_CTRL_REG & I2CIF_CTRL_ENABLED))

#define I2CIF_CHECK_SLAVE_AUTO_ADDR_NACK     (0u != (I2CIF_I2C_CTRL_REG & \
                                                                I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK))


/***************************************
*      I2C Macro Definitions
***************************************/

/* Enable auto ACK/NACK */
#define I2CIF_ENABLE_SLAVE_AUTO_ADDR_NACK \
                            do{                      \
                                I2CIF_I2C_CTRL_REG |= I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define I2CIF_ENABLE_SLAVE_AUTO_DATA_ACK \
                            do{                     \
                                I2CIF_I2C_CTRL_REG |= I2CIF_I2C_CTRL_S_READY_DATA_ACK; \
                            }while(0)

#define I2CIF_ENABLE_SLAVE_AUTO_DATA_NACK \
                            do{                      \
                                I2CIF_I2C_CTRL_REG |= I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define I2CIF_ENABLE_MASTER_AUTO_DATA_ACK \
                            do{                      \
                                I2CIF_I2C_CTRL_REG |= I2CIF_I2C_CTRL_M_READY_DATA_ACK; \
                            }while(0)

#define I2CIF_ENABLE_MASTER_AUTO_DATA_NACK \
                            do{                       \
                                I2CIF_I2C_CTRL_REG |= I2CIF_I2C_CTRL_M_NOT_READY_DATA_NACK; \
                            }while(0)

/* Disable auto ACK/NACK */
#define I2CIF_DISABLE_SLAVE_AUTO_ADDR_NACK \
                            do{                       \
                                I2CIF_I2C_CTRL_REG &= ~I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define I2CIF_DISABLE_SLAVE_AUTO_DATA_ACK \
                            do{                      \
                                I2CIF_I2C_CTRL_REG &= ~I2CIF_I2C_CTRL_S_READY_DATA_ACK; \
                            }while(0)

#define I2CIF_DISABLE_SLAVE_AUTO_DATA_NACK \
                            do{                       \
                                I2CIF_I2C_CTRL_REG &= ~I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define I2CIF_DISABLE_MASTER_AUTO_DATA_ACK \
                            do{                       \
                                I2CIF_I2C_CTRL_REG &= ~I2CIF_I2C_CTRL_M_READY_DATA_ACK; \
                            }while(0)

#define I2CIF_DISABLE_MASTER_AUTO_DATA_NACK \
                            do{                        \
                                I2CIF_I2C_CTRL_REG &= ~I2CIF_I2C_CTRL_M_NOT_READY_DATA_NACK; \
                            }while(0)

/* Enable Slave autoACK/NACK Data */
#define I2CIF_ENABLE_SLAVE_AUTO_DATA \
                            do{                 \
                                I2CIF_I2C_CTRL_REG |= (I2CIF_I2C_CTRL_S_READY_DATA_ACK |      \
                                                                  I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK); \
                            }while(0)

/* Disable Slave autoACK/NACK Data */
#define I2CIF_DISABLE_SLAVE_AUTO_DATA \
                            do{                  \
                                I2CIF_I2C_CTRL_REG &= ((uint32) \
                                                                  ~(I2CIF_I2C_CTRL_S_READY_DATA_ACK |       \
                                                                    I2CIF_I2C_CTRL_S_NOT_READY_DATA_NACK)); \
                            }while(0)

/* Disable Master autoACK/NACK Data */
#define I2CIF_DISABLE_MASTER_AUTO_DATA \
                            do{                   \
                                I2CIF_I2C_CTRL_REG &= ((uint32) \
                                                                  ~(I2CIF_I2C_CTRL_M_READY_DATA_ACK |       \
                                                                    I2CIF_I2C_CTRL_M_NOT_READY_DATA_NACK)); \
                            }while(0)

/* Master commands */
#define I2CIF_I2C_MASTER_GENERATE_START \
                            do{                    \
                                I2CIF_I2C_MASTER_CMD_REG = I2CIF_I2C_MASTER_CMD_M_START_ON_IDLE; \
                            }while(0)

