tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
#define I2CIF_I2C_MASTER_CLEAR_START \
                            do{                 \
                                I2CIF_I2C_MASTER_CMD_REG =  ((uint32) 0u); \
                            }while(0)

#define I2CIF_I2C_MASTER_GENERATE_RESTART I2CIF_I2CReStartGeneration()

#define I2CIF_I2C_MASTER_GENERATE_STOP \
                            do{                   \
                                I2CIF_I2C_MASTER_CMD_REG =                                            \
                                    (I2CIF_I2C_MASTER_CMD_M_STOP |                                    \
                                        (I2CIF_CHECK_I2C_STATUS(I2CIF_I2C_STATUS_M_READ) ? \
                                            (I2CIF_I2C_MASTER_CMD_M_NACK) : (0u)));                   \
                            }while(0)

#define I2CIF_I2C_MASTER_GENERATE_ACK \
                            do{                  \
                                I2CIF_I2C_MASTER_CMD_REG = I2CIF_I2C_MASTER_CMD_M_ACK; \
                            }while(0)

#define I2CIF_I2C_MASTER_GENERATE_NACK \
                            do{                   \
                                I2CIF_I2C_MASTER_CMD_REG = I2CIF_I2C_MASTER_CMD_M_NACK; \
                            }while(0)

/* Slave commands */
#define I2CIF_I2C_SLAVE_GENERATE_ACK \
                            do{                 \
                                I2CIF_I2C_SLAVE_CMD_REG = I2CIF_I2C_SLAVE_CMD_S_ACK; \
                            }while(0)

#if (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    /* Slave NACK generation for EC_AM logic on address phase. Ticket ID #183902 */
    void I2CIF_I2CSlaveNackGeneration(void);
    #define I2CIF_I2C_SLAVE_GENERATE_NACK I2CIF_I2CSlaveNackGeneration()

#else
    #define I2CIF_I2C_SLAVE_GENERATE_NACK \
                            do{                      \
                                I2CIF_I2C_SLAVE_CMD_REG = I2CIF_I2C_SLAVE_CMD_S_NACK; \
                            }while(0)
#endif /* (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */

#define I2CIF_I2C_SLAVE_CLEAR_NACK \
                            do{               \
                                I2CIF_I2C_SLAVE_CMD_REG = 0u; \
                            }while(0)

/* Return 8-bit address. The input address should be 7-bits */
#define I2CIF_GET_I2C_8BIT_ADDRESS(addr) (((uint32) ((uint32) (addr) << \
                                                                    I2CIF_I2C_SLAVE_ADDR_POS)) & \
                                                                        I2CIF_I2C_SLAVE_ADDR_MASK)

#define I2CIF_GET_I2C_7BIT_ADDRESS(addr) ((uint32) (addr) >> I2CIF_I2C_SLAVE_ADDR_POS)

/* Adjust SDA filter Trim settings */
#define I2CIF_DEFAULT_I2C_CFG_SDA_FILT_TRIM  (0x02u)
#define I2CIF_EC_AM_I2C_CFG_SDA_FILT_TRIM    (0x03u)

#if (I2CIF_CY_SCBIP_V0)
    #define I2CIF_SET_I2C_CFG_SDA_FILT_TRIM(sdaTrim) \
        do{                                                 \
            I2CIF_I2C_CFG_REG =                  \
                            ((I2CIF_I2C_CFG_REG & (uint32) ~I2CIF_I2C_CFG_SDA_FILT_TRIM_MASK) | \
                             ((uint32) ((uint32) (sdaTrim) <<I2CIF_I2C_CFG_SDA_FILT_TRIM_POS)));           \
        }while(0)
#endif /* (I2CIF_CY_SCBIP_V0) */

/* Enable/Disable analog and digital filter */
#define I2CIF_DIGITAL_FILTER_DISABLE    (0u)
#define I2CIF_DIGITAL_FILTER_ENABLE     (1u)
#define I2CIF_I2C_DATA_RATE_FS_MODE_MAX (400u)
#if (I2CIF_CY_SCBIP_V0)
    /* I2CIF_I2C_CFG_SDA_FILT_OUT_ENABLED is disabled by default */
    #define I2CIF_I2C_CFG_FILT_MASK  (I2CIF_I2C_CFG_SDA_FILT_ENABLED | \
                                                 I2CIF_I2C_CFG_SCL_FILT_ENABLED)
#else
    /* I2CIF_I2C_CFG_SDA_OUT_FILT_SEL_MASK is disabled by default */
    #define I2CIF_I2C_CFG_FILT_MASK  (I2CIF_I2C_CFG_SDA_IN_FILT_SEL | \
                                                 I2CIF_I2C_CFG_SCL_IN_FILT_SEL)
#endif /* (I2CIF_CY_SCBIP_V0) */

#define I2CIF_I2C_CFG_ANALOG_FITER_DISABLE \
        do{                                           \
            I2CIF_I2C_CFG_REG &= (uint32) ~I2CIF_I2C_CFG_FILT_MASK; \
        }while(0)

#define I2CIF_I2C_CFG_ANALOG_FITER_ENABLE \
        do{                                          \
            I2CIF_I2C_CFG_REG |= (uint32)  I2CIF_I2C_CFG_FILT_MASK; \
        }while(0)

/* Return slave select number from SPI_CTRL register */
#define I2CIF_GET_SPI_CTRL_SS(activeSelect) (((uint32) ((uint32) (activeSelect) << \
                                                                    I2CIF_SPI_CTRL_SLAVE_SELECT_POS)) & \
                                                                        I2CIF_SPI_CTRL_SLAVE_SELECT_MASK)

/* Return true if bit is set in I2CIF_I2C_STATUS_REG */
#define I2CIF_CHECK_I2C_STATUS(sourceMask)   (0u != (I2CIF_I2C_STATUS_REG & (sourceMask)))

/* Return true if bit is set in I2CIF_SPI_STATUS_REG */
#define I2CIF_CHECK_SPI_STATUS(sourceMask)   (0u != (I2CIF_SPI_STATUS_REG & (sourceMask)))

/* Return FIFO size depends on I2CIF_CTRL_BYTE_MODE bit */
#define I2CIF_GET_FIFO_SIZE(condition) ((0u != (condition)) ? \
                                                    (2u * I2CIF_FIFO_SIZE) : (I2CIF_FIFO_SIZE))


/***************************************
*       Get Macros Definitions
***************************************/

/* I2CIF_CTRL */
#define I2CIF_GET_CTRL_OVS(oversample)       (((uint32) (oversample) - 1u) & I2CIF_CTRL_OVS_MASK)

#define I2CIF_GET_CTRL_EC_OP_MODE(opMode)        ((0u != (opMode)) ? \
                                                                (I2CIF_CTRL_EC_OP_MODE)  : (0u))

#define I2CIF_GET_CTRL_EC_AM_MODE(amMode)        ((0u != (amMode)) ? \
                                                                (I2CIF_CTRL_EC_AM_MODE)  : (0u))

#define I2CIF_GET_CTRL_BLOCK(block)              ((0u != (block))  ? \
                                                                (I2CIF_CTRL_BLOCK)       : (0u))

