tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
#define I2CIF_GET_CTRL_ADDR_ACCEPT(acceptAddr)   ((0u != (acceptAddr)) ? \
                                                                (I2CIF_CTRL_ADDR_ACCEPT) : (0u))

#if (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_GET_CTRL_BYTE_MODE(mode)   (0u)
#else
    #define I2CIF_GET_CTRL_BYTE_MODE(mode)   ((0u != (mode)) ? \
                                                            (I2CIF_CTRL_BYTE_MODE) : (0u))
#endif /* (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */

/* I2CIF_I2C_CTRL */
#define I2CIF_GET_I2C_CTRL_HIGH_PHASE_OVS(oversampleHigh) (((uint32) (oversampleHigh) - 1u) & \
                                                                        I2CIF_I2C_CTRL_HIGH_PHASE_OVS_MASK)

#define I2CIF_GET_I2C_CTRL_LOW_PHASE_OVS(oversampleLow)  ((((uint32) (oversampleLow) - 1u) << \
                                                                    I2CIF_I2C_CTRL_LOW_PHASE_OVS_POS) &  \
                                                                    I2CIF_I2C_CTRL_LOW_PHASE_OVS_MASK)

#define I2CIF_GET_I2C_CTRL_S_NOT_READY_ADDR_NACK(wakeNack) ((0u != (wakeNack)) ? \
                                                            (I2CIF_I2C_CTRL_S_NOT_READY_ADDR_NACK) : (0u))

#define I2CIF_GET_I2C_CTRL_S_GENERAL_IGNORE(genCall) ((0u != (genCall)) ? \
                                                                    (I2CIF_I2C_CTRL_S_GENERAL_IGNORE) : (0u))

#define I2CIF_GET_I2C_CTRL_SL_MSTR_MODE(mode)    ((uint32)(mode) << I2CIF_I2C_CTRL_SLAVE_MODE_POS)

/* I2CIF_SPI_CTRL */
#define I2CIF_GET_SPI_CTRL_CONTINUOUS(separate)  ((0u != (separate)) ? \
                                                                (I2CIF_SPI_CTRL_CONTINUOUS) : (0u))

#define I2CIF_GET_SPI_CTRL_SELECT_PRECEDE(mode)  ((0u != (mode)) ? \
                                                                      (I2CIF_SPI_CTRL_SELECT_PRECEDE) : (0u))

#define I2CIF_GET_SPI_CTRL_SCLK_MODE(mode)       (((uint32) (mode) << \
                                                                        I2CIF_SPI_CTRL_CPHA_POS) & \
                                                                        I2CIF_SPI_CTRL_SCLK_MODE_MASK)

#define I2CIF_GET_SPI_CTRL_LATE_MISO_SAMPLE(lateMiso) ((0u != (lateMiso)) ? \
                                                                    (I2CIF_SPI_CTRL_LATE_MISO_SAMPLE) : (0u))

#if (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_GET_SPI_CTRL_SCLK_CONTINUOUS(sclkType) (0u)
    #define I2CIF_GET_SPI_CTRL_SSEL_POLARITY(polarity)   (0u)
#else
    #define I2CIF_GET_SPI_CTRL_SCLK_CONTINUOUS(sclkType) ((0u != (sclkType)) ? \
                                                                    (I2CIF_SPI_CTRL_SCLK_CONTINUOUS) : (0u))

    #define I2CIF_GET_SPI_CTRL_SSEL_POLARITY(polarity)   (((uint32) (polarity) << \
                                                                     I2CIF_SPI_CTRL_SSEL0_POLARITY_POS) & \
                                                                     I2CIF_SPI_CTRL_SSEL_POLARITY_MASK)
#endif /* ((I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */

#define I2CIF_GET_SPI_CTRL_SUB_MODE(mode)        (((uint32) (mode) << I2CIF_SPI_CTRL_MODE_POS) & \
                                                                                 I2CIF_SPI_CTRL_MODE_MASK)

#define I2CIF_GET_SPI_CTRL_SLAVE_SELECT(select)  (((uint32) (select) << \
                                                                      I2CIF_SPI_CTRL_SLAVE_SELECT_POS) & \
                                                                      I2CIF_SPI_CTRL_SLAVE_SELECT_MASK)

#define I2CIF_GET_SPI_CTRL_MASTER_MODE(mode)     ((0u != (mode)) ? \
                                                                (I2CIF_SPI_CTRL_MASTER) : (0u))

/* I2CIF_UART_CTRL */
#define I2CIF_GET_UART_CTRL_MODE(mode)           (((uint32) (mode) << \
                                                                            I2CIF_UART_CTRL_MODE_POS) & \
                                                                            I2CIF_UART_CTRL_MODE_MASK)

/* I2CIF_UART_RX_CTRL */
#define I2CIF_GET_UART_RX_CTRL_MODE(stopBits)    (((uint32) (stopBits) - 1u) & \
                                                                        I2CIF_UART_RX_CTRL_STOP_BITS_MASK)

#define I2CIF_GET_UART_RX_CTRL_PARITY(parity)    ((0u != (parity)) ? \
                                                                    (I2CIF_UART_RX_CTRL_PARITY) : (0u))

#define I2CIF_GET_UART_RX_CTRL_POLARITY(polarity)    ((0u != (polarity)) ? \
                                                                    (I2CIF_UART_RX_CTRL_POLARITY) : (0u))

#define I2CIF_GET_UART_RX_CTRL_DROP_ON_PARITY_ERR(dropErr) ((0u != (dropErr)) ? \
                                                        (I2CIF_UART_RX_CTRL_DROP_ON_PARITY_ERR) : (0u))

#define I2CIF_GET_UART_RX_CTRL_DROP_ON_FRAME_ERR(dropErr) ((0u != (dropErr)) ? \
                                                        (I2CIF_UART_RX_CTRL_DROP_ON_FRAME_ERR) : (0u))

#define I2CIF_GET_UART_RX_CTRL_MP_MODE(mpMode)   ((0u != (mpMode)) ? \
                                                        (I2CIF_UART_RX_CTRL_MP_MODE) : (0u))

/* I2CIF_UART_TX_CTRL */
#define I2CIF_GET_UART_TX_CTRL_MODE(stopBits)    (((uint32) (stopBits) - 1u) & \
                                                                I2CIF_UART_RX_CTRL_STOP_BITS_MASK)

#define I2CIF_GET_UART_TX_CTRL_PARITY(parity)    ((0u != (parity)) ? \
                                                               (I2CIF_UART_TX_CTRL_PARITY) : (0u))

#define I2CIF_GET_UART_TX_CTRL_RETRY_NACK(nack)  ((0u != (nack)) ? \
                                                               (I2CIF_UART_TX_CTRL_RETRY_ON_NACK) : (0u))

/* I2CIF_UART_FLOW_CTRL */
#if !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
    #define I2CIF_GET_UART_FLOW_CTRL_TRIGGER_LEVEL(level)   ( (uint32) (level) & \
                                                                 I2CIF_UART_FLOW_CTRL_TRIGGER_LEVEL_MASK)

    #define I2CIF_GET_UART_FLOW_CTRL_RTS_POLARITY(polarity) ((0u != (polarity)) ? \
                                                                (I2CIF_UART_FLOW_CTRL_RTS_POLARITY) : (0u))

