tslator/DualBoard-043/Board1-RPi.cydsn/Generated_Source/PSoC4/I2CIF.h
    #define I2CIF_GET_UART_FLOW_CTRL_CTS_POLARITY(polarity) ((0u != (polarity)) ? \
                                                                (I2CIF_UART_FLOW_CTRL_CTS_POLARITY) : (0u))

    #define I2CIF_GET_UART_FLOW_CTRL_CTS_ENABLE(ctsEn)      ((0u != (ctsEn)) ? \
                                                                (I2CIF_UART_FLOW_CTRL_CTS_ENABLE) : (0u))
#endif /* !(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */

/* I2CIF_RX_CTRL */
#define I2CIF_GET_RX_CTRL_DATA_WIDTH(dataWidth)  (((uint32) (dataWidth) - 1u) & \
                                                                I2CIF_RX_CTRL_DATA_WIDTH_MASK)

#define I2CIF_GET_RX_CTRL_BIT_ORDER(bitOrder)    ((0u != (bitOrder)) ? \
                                                                (I2CIF_RX_CTRL_MSB_FIRST) : (0u))

#define I2CIF_GET_RX_CTRL_MEDIAN(filterEn)       ((0u != (filterEn)) ? \
                                                                (I2CIF_RX_CTRL_MEDIAN) : (0u))

/* I2CIF_RX_MATCH */
#define I2CIF_GET_RX_MATCH_ADDR(addr)    ((uint32) (addr) & I2CIF_RX_MATCH_ADDR_MASK)
#define I2CIF_GET_RX_MATCH_MASK(mask)    (((uint32) (mask) << \
                                                            I2CIF_RX_MATCH_MASK_POS) & \
                                                            I2CIF_RX_MATCH_MASK_MASK)

/* I2CIF_RX_FIFO_CTRL */
#define I2CIF_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(level)  ((uint32) (level) & \
                                                                    I2CIF_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK)

/* I2CIF_TX_CTRL */
#define I2CIF_GET_TX_CTRL_DATA_WIDTH(dataWidth)  (((uint32) (dataWidth) - 1u) & \
                                                                I2CIF_RX_CTRL_DATA_WIDTH_MASK)

#define I2CIF_GET_TX_CTRL_BIT_ORDER(bitOrder)    ((0u != (bitOrder)) ? \
                                                                (I2CIF_TX_CTRL_MSB_FIRST) : (0u))

/* I2CIF_TX_FIFO_CTRL */
#define I2CIF_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(level)  ((uint32) (level) & \
                                                                    I2CIF_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK)

/* I2CIF_INTR_SLAVE_I2C_GENERAL */
#define I2CIF_GET_INTR_SLAVE_I2C_GENERAL(genCall)  ((0u != (genCall)) ? \
                                                                (I2CIF_INTR_SLAVE_I2C_GENERAL) : (0u))

/* Return true if master mode is enabled I2CIF_SPI_CTRL_REG */
#define I2CIF_CHECK_SPI_MASTER   (0u != (I2CIF_SPI_CTRL_REG & I2CIF_SPI_CTRL_MASTER))

/* Return inactive state of SPI SCLK line depends on CPOL */
#define I2CIF_GET_SPI_SCLK_INACTIVE \
            ((0u == (I2CIF_SPI_CTRL_REG & I2CIF_SPI_CTRL_CPOL)) ? (0u) : (1u))

/* Get output pin inactive state */
#if (I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1)
#define I2CIF_GET_SPI_SS0_INACTIVE       (1u)
#define I2CIF_GET_SPI_SS1_INACTIVE       (1u)
#define I2CIF_GET_SPI_SS2_INACTIVE       (1u)
#define I2CIF_GET_SPI_SS3_INACTIVE       (1u)
#define I2CIF_GET_UART_RTS_INACTIVE      (1u)

#else
#define I2CIF_GET_SPI_SS0_INACTIVE  \
        ((0u != (I2CIF_SPI_CTRL_REG & I2CIF_SPI_CTRL_SSEL0_POLARITY)) ? (0u) : (1u))

#define I2CIF_GET_SPI_SS1_INACTIVE  \
        ((0u != (I2CIF_SPI_CTRL_REG & I2CIF_SPI_CTRL_SSEL1_POLARITY)) ? (0u) : (1u))

#define I2CIF_GET_SPI_SS2_INACTIVE  \
        ((0u != (I2CIF_SPI_CTRL_REG & I2CIF_SPI_CTRL_SSEL2_POLARITY)) ? (0u) : (1u))

#define I2CIF_GET_SPI_SS3_INACTIVE  \
        ((0u != (I2CIF_SPI_CTRL_REG & I2CIF_SPI_CTRL_SSEL3_POLARITY)) ? (0u) : (1u))

#define I2CIF_GET_UART_RTS_INACTIVE \
        ((0u == (I2CIF_UART_FLOW_CTRL_REG & I2CIF_UART_FLOW_CTRL_RTS_POLARITY)) ? (0u) : (1u))

#endif /*(I2CIF_CY_SCBIP_V0 || I2CIF_CY_SCBIP_V1) */

/* Clear register constants for configuration and interrupt mask */
#define I2CIF_CLEAR_REG          ((uint32) (0u))
#define I2CIF_NO_INTR_SOURCES    ((uint32) (0u))
#define I2CIF_DUMMY_PARAM        ((uint32) (0u))
#define I2CIF_SUBMODE_SPI_SLAVE  ((uint32) (0u))

/* Return in case of I2C read error */
#define I2CIF_I2C_INVALID_BYTE   ((uint32) 0xFFFFFFFFu)
#define I2CIF_CHECK_VALID_BYTE   ((uint32) 0x80000000u)


/***************************************
* The following code is DEPRECATED and
* must not be used.
***************************************/

#define I2CIF_CHECK_INTR_EC_I2C(sourceMask)  I2CIF_CHECK_INTR_I2C_EC(sourceMask)
#if (!I2CIF_CY_SCBIP_V1)
    #define I2CIF_CHECK_INTR_EC_SPI(sourceMask)  I2CIF_CHECK_INTR_SPI_EC(sourceMask)
#endif /* (!I2CIF_CY_SCBIP_V1) */

#define I2CIF_CY_SCBIP_V1_I2C_ONLY   (I2CIF_CY_SCBIP_V1)

#endif /* (CY_SCB_I2CIF_H) */


/* [] END OF FILE */
